// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: Mono.Security.PKCS7
#include "Mono/Security/PKCS7.hpp"
// Including type: Mono.Security.Cryptography.PKCS8
#include "Mono/Security/Cryptography/PKCS8.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
  // Forward declaring type: X509Certificate
  class X509Certificate;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IDictionary
  class IDictionary;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: RandomNumberGenerator
  class RandomNumberGenerator;
  // Forward declaring type: SymmetricAlgorithm
  class SymmetricAlgorithm;
  // Forward declaring type: DSAParameters
  struct DSAParameters;
  // Forward declaring type: AsymmetricAlgorithm
  class AsymmetricAlgorithm;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: Mono::Security
namespace Mono::Security {
  // Forward declaring type: ASN1
  class ASN1;
}
// Completed forward declares
// Type namespace: Mono.Security.X509
namespace Mono::Security::X509 {
  // Forward declaring type: PKCS12
  class PKCS12;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Mono::Security::X509::PKCS12);
DEFINE_IL2CPP_ARG_TYPE(::Mono::Security::X509::PKCS12*, "Mono.Security.X509", "PKCS12");
// Type namespace: Mono.Security.X509
namespace Mono::Security::X509 {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Security.X509.PKCS12
  // [TokenAttribute] Offset: FFFFFFFF
  class PKCS12 : public ::Il2CppObject/*, public ::System::ICloneable*/ {
    public:
    // Nested type: ::Mono::Security::X509::PKCS12::DeriveBytes
    class DeriveBytes;
    public:
    // private System.Byte[] _password
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<uint8_t> password;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Collections.ArrayList _keyBags
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::ArrayList* keyBags;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Collections.ArrayList _secretBags
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::ArrayList* secretBags;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private Mono.Security.X509.X509CertificateCollection _certs
    // Size: 0x8
    // Offset: 0x28
    ::Mono::Security::X509::X509CertificateCollection* certs;
    // Field size check
    static_assert(sizeof(::Mono::Security::X509::X509CertificateCollection*) == 0x8);
    // private System.Boolean _keyBagsChanged
    // Size: 0x1
    // Offset: 0x30
    bool keyBagsChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _secretBagsChanged
    // Size: 0x1
    // Offset: 0x31
    bool secretBagsChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _certsChanged
    // Size: 0x1
    // Offset: 0x32
    bool certsChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: certsChanged and: iterations
    char __padding6[0x1] = {};
    // private System.Int32 _iterations
    // Size: 0x4
    // Offset: 0x34
    int iterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.ArrayList _safeBags
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::ArrayList* safeBags;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    // private System.Security.Cryptography.RandomNumberGenerator _rng
    // Size: 0x8
    // Offset: 0x40
    ::System::Security::Cryptography::RandomNumberGenerator* rng;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::RandomNumberGenerator*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // static field const value: static public System.String pbeWithSHAAnd128BitRC4
    static constexpr const char* pbeWithSHAAnd128BitRC4 = "1.2.840.113549.1.12.1.1";
    // Get static field: static public System.String pbeWithSHAAnd128BitRC4
    static ::StringW _get_pbeWithSHAAnd128BitRC4();
    // Set static field: static public System.String pbeWithSHAAnd128BitRC4
    static void _set_pbeWithSHAAnd128BitRC4(::StringW value);
    // static field const value: static public System.String pbeWithSHAAnd40BitRC4
