// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Mono::Security::X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509Store
  class X509Store;
}
// Completed forward declares
// Type namespace: Mono.Security.X509
namespace Mono::Security::X509 {
  // Forward declaring type: X509Stores
  class X509Stores;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Mono::Security::X509::X509Stores);
DEFINE_IL2CPP_ARG_TYPE(::Mono::Security::X509::X509Stores*, "Mono.Security.X509", "X509Stores");
// Type namespace: Mono.Security.X509
namespace Mono::Security::X509 {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Mono.Security.X509.X509Stores
  // [TokenAttribute] Offset: FFFFFFFF
  class X509Stores : public ::Il2CppObject {
    public:
    // Nested type: ::Mono::Security::X509::X509Stores::Names
    class Names;
    public:
    // private System.String _storePath
    // Size: 0x8
    // Offset: 0x10
    ::StringW storePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _newFormat
    // Size: 0x1
    // Offset: 0x18
    bool newFormat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: newFormat and: personal
    char __padding1[0x7] = {};
    // private Mono.Security.X509.X509Store _personal
    // Size: 0x8
    // Offset: 0x20
    ::Mono::Security::X509::X509Store* personal;
    // Field size check
    static_assert(sizeof(::Mono::Security::X509::X509Store*) == 0x8);
    // private Mono.Security.X509.X509Store _other
    // Size: 0x8
    // Offset: 0x28
    ::Mono::Security::X509::X509Store* other;
    // Field size check
    static_assert(sizeof(::Mono::Security::X509::X509Store*) == 0x8);
    // private Mono.Security.X509.X509Store _intermediate
    // Size: 0x8
    // Offset: 0x30
    ::Mono::Security::X509::X509Store* intermediate;
    // Field size check
    static_assert(sizeof(::Mono::Security::X509::X509Store*) == 0x8);
    // private Mono.Security.X509.X509Store _trusted
    // Size: 0x8
    // Offset: 0x38
    ::Mono::Security::X509::X509Store* trusted;
    // Field size check
    static_assert(sizeof(::Mono::Security::X509::X509Store*) == 0x8);
    // private Mono.Security.X509.X509Store _untrusted
    // Size: 0x8
    // Offset: 0x40
    ::Mono::Security::X509::X509Store* untrusted;
    // Field size check
    static_assert(sizeof(::Mono::Security::X509::X509Store*) == 0x8);
    public:
    // Get instance field reference: private System.String _storePath
    [[deprecated("Use field access instead!")]] ::StringW& dyn__storePath();
    // Get instance field reference: private System.Boolean _newFormat
    [[deprecated("Use field access instead!")]] bool& dyn__newFormat();
    // Get instance field reference: private Mono.Security.X509.X509Store _personal
    [[deprecated("Use field access instead!")]] ::Mono::Security::X509::X509Store*& dyn__personal();
    // Get instance field reference: private Mono.Security.X509.X509Store _other
    [[deprecated("Use field access instead!")]] ::Mono::Security::X509::X509Store*& dyn__other();
    // Get instance field reference: private Mono.Security.X509.X509Store _intermediate
    [[deprecated("Use field access instead!")]] ::Mono::Security::X509::X509Store*& dyn__intermediate();
    // Get instance field reference: private Mono.Security.X509.X509Store _trusted
    [[deprecated("Use field access instead!")]] ::Mono::Security::X509::X509Store*& dyn__trusted();
    // Get instance field reference: private Mono.Security.X509.X509Store _untrusted
    [[deprecated("Use field access instead!")]] ::Mono::Security::X509::X509Store*& dyn__untrusted();
    // System.Void .ctor(System.String path, System.Boolean newFormat)
    // Offset: 0x1B2ADB0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static X509Stores* New_ctor(::StringW path, bool newFormat) {
      static auto ___internal__logger = ::Logger::get().WithContext("::Mono::Security::X509::X509Stores::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<X509Stores*, creationType>(path, newFormat)));
    }
    // public Mono.Security.X509.X509Store get_Personal()
    // Offset: 0x1B2B644
    ::Mono::Security::X509::X509Store* get_Personal();
    // public Mono.Security.X509.X509Store get_OtherPeople()
    // Offset: 0x1B2B704
    ::Mono::Security::X509::X509Store* get_OtherPeople();
    // public Mono.Security.X509.X509Store get_IntermediateCA()
    // Offset: 0x1B2B0B4
    ::Mono::Security::X509::X509Store* get_IntermediateCA();
    // public Mono.Security.X509.X509Store get_TrustedRoot()
    // Offset: 0x1B2B318
    ::Mono::Security::X509::X509Store* get_TrustedRoot();
    // public Mono.Security.X509.X509Store get_Untrusted()
    // Offset: 0x1B2B57C
    ::Mono::Security::X509::X509Store* get_Untrusted();
    // public System.Void Clear()
    // Offset: 0x1B2B7C4
    void Clear();
    // public Mono.Security.X509.X509Store Open(System.String storeName, System.Boolean create)
    // Offset: 0x1B2B830
    ::Mono::Security::X509::X509Store* Open(::StringW storeName, bool create);
  }; // Mono.Security.X509.X509Stores
  #pragma pack(pop)
  static check_size<sizeof(X509Stores), 64 + sizeof(::Mono::Security::X509::X509Store*)> __Mono_Security_X509_X509StoresSizeCheck;
  static_assert(sizeof(X509Stores) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::get_Personal
// Il2CppName: get_Personal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Mono::Security::X509::X509Store* (Mono::Security::X509::X509Stores::*)()>(&Mono::Security::X509::X509Stores::get_Personal)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "get_Personal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::get_OtherPeople
// Il2CppName: get_OtherPeople
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Mono::Security::X509::X509Store* (Mono::Security::X509::X509Stores::*)()>(&Mono::Security::X509::X509Stores::get_OtherPeople)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "get_OtherPeople", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::get_IntermediateCA
// Il2CppName: get_IntermediateCA
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Mono::Security::X509::X509Store* (Mono::Security::X509::X509Stores::*)()>(&Mono::Security::X509::X509Stores::get_IntermediateCA)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "get_IntermediateCA", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::get_TrustedRoot
// Il2CppName: get_TrustedRoot
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Mono::Security::X509::X509Store* (Mono::Security::X509::X509Stores::*)()>(&Mono::Security::X509::X509Stores::get_TrustedRoot)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "get_TrustedRoot", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::get_Untrusted
// Il2CppName: get_Untrusted
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Mono::Security::X509::X509Store* (Mono::Security::X509::X509Stores::*)()>(&Mono::Security::X509::X509Stores::get_Untrusted)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "get_Untrusted", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::Clear
// Il2CppName: Clear
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Mono::Security::X509::X509Stores::*)()>(&Mono::Security::X509::X509Stores::Clear)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "Clear", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Mono::Security::X509::X509Stores::Open
// Il2CppName: Open
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Mono::Security::X509::X509Store* (Mono::Security::X509::X509Stores::*)(::StringW, bool)>(&Mono::Security::X509::X509Stores::Open)> {
  static const MethodInfo* get() {
    static auto* storeName = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* create = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Mono::Security::X509::X509Stores*), "Open", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{storeName, create});
  }
};
