// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
  // Forward declaring type: SelectMode
  struct SelectMode;
  // Forward declaring type: SocketShutdown
  struct SocketShutdown;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: FileAccess
  struct FileAccess;
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: BufferOffsetSize
  class BufferOffsetSize;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Forward declaring type: NetworkStream
  class NetworkStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::Sockets::NetworkStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::Sockets::NetworkStream*, "System.Net.Sockets", "NetworkStream");
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Sockets.NetworkStream
  // [TokenAttribute] Offset: FFFFFFFF
  class NetworkStream : public ::System::IO::Stream {
    public:
    public:
    // private System.Net.Sockets.Socket m_StreamSocket
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::Sockets::Socket* m_StreamSocket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // private System.Boolean m_Readable
    // Size: 0x1
    // Offset: 0x30
    bool m_Readable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Writeable
    // Size: 0x1
    // Offset: 0x31
    bool m_Writeable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_OwnsSocket
    // Size: 0x1
    // Offset: 0x32
    bool m_OwnsSocket;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_OwnsSocket and: m_CloseTimeout
    char __padding3[0x1] = {};
    // private System.Int32 m_CloseTimeout
    // Size: 0x4
    // Offset: 0x34
    int m_CloseTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_CleanedUp
    // Size: 0x1
    // Offset: 0x38
    bool m_CleanedUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CleanedUp and: m_CurrentReadTimeout
    char __padding5[0x3] = {};
    // private System.Int32 m_CurrentReadTimeout
    // Size: 0x4
    // Offset: 0x3C
    int m_CurrentReadTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CurrentWriteTimeout
    // Size: 0x4
    // Offset: 0x40
    int m_CurrentWriteTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private System.Net.Sockets.Socket m_StreamSocket
    [[deprecated("Use field access instead!")]] ::System::Net::Sockets::Socket*& dyn_m_StreamSocket();
    // Get instance field reference: private System.Boolean m_Readable
    [[deprecated("Use field access instead!")]] bool& dyn_m_Readable();
    // Get instance field reference: private System.Boolean m_Writeable
    [[deprecated("Use field access instead!")]] bool& dyn_m_Writeable();
    // Get instance field reference: private System.Boolean m_OwnsSocket
    [[deprecated("Use field access instead!")]] bool& dyn_m_OwnsSocket();
    // Get instance field reference: private System.Int32 m_CloseTimeout
    [[deprecated("Use field access instead!")]] int& dyn_m_CloseTimeout();
    // Get instance field reference: private System.Boolean m_CleanedUp
