// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.UIElements.PropagationPhase
#include "UnityEngine/UIElements/PropagationPhase.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: PropagationPaths
  class PropagationPaths;
  // Forward declaring type: IEventHandler
  class IEventHandler;
  // Skipping declaration: EventPropagation because it is already included!
  // Skipping declaration: LifeCycleStatus because it is already included!
  // Forward declaring type: IPanel
  class IPanel;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Event
  class Event;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: EventBase
  class EventBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::EventBase);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::EventBase*, "UnityEngine.UIElements", "EventBase");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.EventBase
  // [TokenAttribute] Offset: FFFFFFFF
  class EventBase : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::EventBase::EventPropagation
    struct EventPropagation;
    // Nested type: ::UnityEngine::UIElements::EventBase::LifeCycleStatus
    struct LifeCycleStatus;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.EventBase/EventPropagation
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct EventPropagation/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EventPropagation
      constexpr EventPropagation(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.EventBase/EventPropagation None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UIElements.EventBase/EventPropagation None
      static ::UnityEngine::UIElements::EventBase::EventPropagation _get_None();
      // Set static field: static public UnityEngine.UIElements.EventBase/EventPropagation None
      static void _set_None(::UnityEngine::UIElements::EventBase::EventPropagation value);
      // static field const value: static public UnityEngine.UIElements.EventBase/EventPropagation Bubbles
      static constexpr const int Bubbles = 1;
      // Get static field: static public UnityEngine.UIElements.EventBase/EventPropagation Bubbles
      static ::UnityEngine::UIElements::EventBase::EventPropagation _get_Bubbles();
      // Set static field: static public UnityEngine.UIElements.EventBase/EventPropagation Bubbles
      static void _set_Bubbles(::UnityEngine::UIElements::EventBase::EventPropagation value);
      // static field const value: static public UnityEngine.UIElements.EventBase/EventPropagation TricklesDown
      static constexpr const int TricklesDown = 2;
      // Get static field: static public UnityEngine.UIElements.EventBase/EventPropagation TricklesDown
      static ::UnityEngine::UIElements::EventBase::EventPropagation _get_TricklesDown();
      // Set static field: static public UnityEngine.UIElements.EventBase/EventPropagation TricklesDown
      static void _set_TricklesDown(::UnityEngine::UIElements::EventBase::EventPropagation value);
      // static field const value: static public UnityEngine.UIElements.EventBase/EventPropagation Cancellable
      static constexpr const int Cancellable = 4;
      // Get static field: static public UnityEngine.UIElements.EventBase/EventPropagation Cancellable
      static ::UnityEngine::UIElements::EventBase::EventPropagation _get_Cancellable();
      // Set static field: static public UnityEngine.UIElements.EventBase/EventPropagation Cancellable
      static void _set_Cancellable(::UnityEngine::UIElements::EventBase::EventPropagation value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.EventBase/EventPropagation
    #pragma pack(pop)
    static check_size<sizeof(EventBase::EventPropagation), 0 + sizeof(int)> __UnityEngine_UIElements_EventBase_EventPropagationSizeCheck;
    static_assert(sizeof(EventBase::EventPropagation) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.EventBase/LifeCycleStatus
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct LifeCycleStatus/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LifeCycleStatus
      constexpr LifeCycleStatus(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus None
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_None();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus None
      static void _set_None(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus PropagationStopped
      static constexpr const int PropagationStopped = 1;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus PropagationStopped
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_PropagationStopped();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus PropagationStopped
      static void _set_PropagationStopped(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus ImmediatePropagationStopped
      static constexpr const int ImmediatePropagationStopped = 2;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus ImmediatePropagationStopped
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_ImmediatePropagationStopped();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus ImmediatePropagationStopped
      static void _set_ImmediatePropagationStopped(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus DefaultPrevented
      static constexpr const int DefaultPrevented = 4;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus DefaultPrevented
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_DefaultPrevented();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus DefaultPrevented
      static void _set_DefaultPrevented(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Dispatching
      static constexpr const int Dispatching = 8;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Dispatching
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_Dispatching();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Dispatching
      static void _set_Dispatching(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Pooled
      static constexpr const int Pooled = 16;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Pooled
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_Pooled();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Pooled
      static void _set_Pooled(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus IMGUIEventIsValid
      static constexpr const int IMGUIEventIsValid = 32;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus IMGUIEventIsValid
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_IMGUIEventIsValid();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus IMGUIEventIsValid
      static void _set_IMGUIEventIsValid(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus StopDispatch
      static constexpr const int StopDispatch = 64;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus StopDispatch
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_StopDispatch();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus StopDispatch
      static void _set_StopDispatch(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus PropagateToIMGUI
      static constexpr const int PropagateToIMGUI = 128;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus PropagateToIMGUI
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_PropagateToIMGUI();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus PropagateToIMGUI
      static void _set_PropagateToIMGUI(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Dispatched
      static constexpr const int Dispatched = 512;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Dispatched
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_Dispatched();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Dispatched
      static void _set_Dispatched(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // static field const value: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Processed
      static constexpr const int Processed = 1024;
      // Get static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Processed
      static ::UnityEngine::UIElements::EventBase::LifeCycleStatus _get_Processed();
      // Set static field: static public UnityEngine.UIElements.EventBase/LifeCycleStatus Processed
      static void _set_Processed(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.EventBase/LifeCycleStatus
    #pragma pack(pop)
    static check_size<sizeof(EventBase::LifeCycleStatus), 0 + sizeof(int)> __UnityEngine_UIElements_EventBase_LifeCycleStatusSizeCheck;
    static_assert(sizeof(EventBase::LifeCycleStatus) == 0x4);
    public:
    // [DebuggerBrowsableAttribute] Offset: 0xAA0548
    // [CompilerGeneratedAttribute] Offset: 0xAA0548
    // private System.Int64 <timestamp>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    int64_t timestamp;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0xAA0584
    // [CompilerGeneratedAttribute] Offset: 0xAA0584
    // private System.UInt64 <eventId>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    uint64_t eventId;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0xAA05C0
    // [CompilerGeneratedAttribute] Offset: 0xAA05C0
    // private System.UInt64 <triggerEventId>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    uint64_t triggerEventId;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0xAA05FC
    // [CompilerGeneratedAttribute] Offset: 0xAA05FC
    // private UnityEngine.UIElements.EventBase/EventPropagation <propagation>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::UIElements::EventBase::EventPropagation propagation;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::EventBase::EventPropagation) == 0x4);
    // Padding between fields: propagation and: m_Path
    char __padding3[0x4] = {};
    // private UnityEngine.UIElements.PropagationPaths m_Path
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UIElements::PropagationPaths* m_Path;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PropagationPaths*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAA0638
    // [DebuggerBrowsableAttribute] Offset: 0xAA0638
    // private UnityEngine.UIElements.EventBase/LifeCycleStatus <lifeCycleStatus>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::UIElements::EventBase::LifeCycleStatus lifeCycleStatus;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::EventBase::LifeCycleStatus) == 0x4);
    // Padding between fields: lifeCycleStatus and: leafTarget
    char __padding5[0x4] = {};
    // [DebuggerBrowsableAttribute] Offset: 0xAA0674
    // [CompilerGeneratedAttribute] Offset: 0xAA0674
    // private UnityEngine.UIElements.IEventHandler <leafTarget>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UIElements::IEventHandler* leafTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IEventHandler*) == 0x8);
    // private UnityEngine.UIElements.IEventHandler m_Target
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UIElements::IEventHandler* m_Target;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAA06B0
    // [DebuggerBrowsableAttribute] Offset: 0xAA06B0
    // private readonly System.Collections.Generic.List`1<UnityEngine.UIElements.IEventHandler> <skipElements>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::IEventHandler*>* skipElements;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::IEventHandler*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAA06EC
    // [DebuggerBrowsableAttribute] Offset: 0xAA06EC
    // private UnityEngine.UIElements.PropagationPhase <propagationPhase>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    ::UnityEngine::UIElements::PropagationPhase propagationPhase;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PropagationPhase) == 0x4);
    // Padding between fields: propagationPhase and: m_CurrentTarget
    char __padding9[0x4] = {};
    // private UnityEngine.UIElements.IEventHandler m_CurrentTarget
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UIElements::IEventHandler* m_CurrentTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IEventHandler*) == 0x8);
    // private UnityEngine.Event m_ImguiEvent
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Event* m_ImguiEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Event*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAA0728
    // [DebuggerBrowsableAttribute] Offset: 0xAA0728
    // private UnityEngine.Vector2 <originalMousePosition>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Vector2 originalMousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static private System.Int64 s_LastTypeId
    static int64_t _get_s_LastTypeId();
    // Set static field: static private System.Int64 s_LastTypeId
    static void _set_s_LastTypeId(int64_t value);
    // Get static field: static private System.UInt64 s_NextEventId
    static uint64_t _get_s_NextEventId();
    // Set static field: static private System.UInt64 s_NextEventId
    static void _set_s_NextEventId(uint64_t value);
    // Get instance field reference: private System.Int64 <timestamp>k__BackingField
    [[deprecated("Use field access instead!")]] int64_t& dyn_$timestamp$k__BackingField();
    // Get instance field reference: private System.UInt64 <eventId>k__BackingField
    [[deprecated("Use field access instead!")]] uint64_t& dyn_$eventId$k__BackingField();
    // Get instance field reference: private System.UInt64 <triggerEventId>k__BackingField
    [[deprecated("Use field access instead!")]] uint64_t& dyn_$triggerEventId$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.EventBase/EventPropagation <propagation>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::EventBase::EventPropagation& dyn_$propagation$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.PropagationPaths m_Path
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::PropagationPaths*& dyn_m_Path();
    // Get instance field reference: private UnityEngine.UIElements.EventBase/LifeCycleStatus <lifeCycleStatus>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::EventBase::LifeCycleStatus& dyn_$lifeCycleStatus$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.IEventHandler <leafTarget>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::IEventHandler*& dyn_$leafTarget$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.IEventHandler m_Target
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::IEventHandler*& dyn_m_Target();
    // Get instance field reference: private readonly System.Collections.Generic.List`1<UnityEngine.UIElements.IEventHandler> <skipElements>k__BackingField
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::IEventHandler*>*& dyn_$skipElements$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.PropagationPhase <propagationPhase>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::PropagationPhase& dyn_$propagationPhase$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.IEventHandler m_CurrentTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::IEventHandler*& dyn_m_CurrentTarget();
    // Get instance field reference: private UnityEngine.Event m_ImguiEvent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Event*& dyn_m_ImguiEvent();
    // Get instance field reference: private UnityEngine.Vector2 <originalMousePosition>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$originalMousePosition$k__BackingField();
    // static protected System.Int64 RegisterEventType()
    // Offset: 0xD422B8
    static int64_t RegisterEventType();
    // public System.Int64 get_eventTypeId()
    // Offset: 0xD42328
    int64_t get_eventTypeId();
    // private System.Void set_timestamp(System.Int64 value)
    // Offset: 0xD42330
    void set_timestamp(int64_t value);
    // System.UInt64 get_eventId()
    // Offset: 0xD42338
    uint64_t get_eventId();
    // private System.Void set_eventId(System.UInt64 value)
    // Offset: 0xD42340
    void set_eventId(uint64_t value);
    // private System.Void set_triggerEventId(System.UInt64 value)
    // Offset: 0xD42348
    void set_triggerEventId(uint64_t value);
    // System.Void SetTriggerEventId(System.UInt64 id)
    // Offset: 0xD42350
    void SetTriggerEventId(uint64_t id);
    // UnityEngine.UIElements.EventBase/EventPropagation get_propagation()
    // Offset: 0xD42358
    ::UnityEngine::UIElements::EventBase::EventPropagation get_propagation();
    // System.Void set_propagation(UnityEngine.UIElements.EventBase/EventPropagation value)
    // Offset: 0xD42360
    void set_propagation(::UnityEngine::UIElements::EventBase::EventPropagation value);
    // UnityEngine.UIElements.PropagationPaths get_path()
    // Offset: 0xD42368
    ::UnityEngine::UIElements::PropagationPaths* get_path();
    // System.Void set_path(UnityEngine.UIElements.PropagationPaths value)
    // Offset: 0xD42670
    void set_path(::UnityEngine::UIElements::PropagationPaths* value);
    // private UnityEngine.UIElements.EventBase/LifeCycleStatus get_lifeCycleStatus()
    // Offset: 0xD427CC
    ::UnityEngine::UIElements::EventBase::LifeCycleStatus get_lifeCycleStatus();
    // private System.Void set_lifeCycleStatus(UnityEngine.UIElements.EventBase/LifeCycleStatus value)
    // Offset: 0xD427D4
    void set_lifeCycleStatus(::UnityEngine::UIElements::EventBase::LifeCycleStatus value);
    // protected System.Void PreDispatch()
    // Offset: 0xD427DC
    void PreDispatch();
    // protected internal System.Void PreDispatch(UnityEngine.UIElements.IPanel panel)
    // Offset: 0xD3F5A8
    void PreDispatch(::UnityEngine::UIElements::IPanel* panel);
    // protected System.Void PostDispatch()
    // Offset: 0xD427E0
    void PostDispatch();
    // protected internal System.Void PostDispatch(UnityEngine.UIElements.IPanel panel)
    // Offset: 0xD427E4
    void PostDispatch(::UnityEngine::UIElements::IPanel* panel);
    // public System.Boolean get_bubbles()
    // Offset: 0xD42444
    bool get_bubbles();
    // public System.Boolean get_tricklesDown()
    // Offset: 0xD42438
    bool get_tricklesDown();
    // UnityEngine.UIElements.IEventHandler get_leafTarget()
    // Offset: 0xD42834
    ::UnityEngine::UIElements::IEventHandler* get_leafTarget();
    // private System.Void set_leafTarget(UnityEngine.UIElements.IEventHandler value)
    // Offset: 0xD4283C
    void set_leafTarget(::UnityEngine::UIElements::IEventHandler* value);
    // public UnityEngine.UIElements.IEventHandler get_target()
    // Offset: 0xD40D24
    ::UnityEngine::UIElements::IEventHandler* get_target();
    // public System.Void set_target(UnityEngine.UIElements.IEventHandler value)
    // Offset: 0xD400F8
    void set_target(::UnityEngine::UIElements::IEventHandler* value);
    // System.Collections.Generic.List`1<UnityEngine.UIElements.IEventHandler> get_skipElements()
    // Offset: 0xD42844
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::IEventHandler*>* get_skipElements();
    // System.Boolean Skip(UnityEngine.UIElements.IEventHandler h)
    // Offset: 0xD3FD74
    bool Skip(::UnityEngine::UIElements::IEventHandler* h);
    // public System.Boolean get_isPropagationStopped()
    // Offset: 0xD3F818
    bool get_isPropagationStopped();
    // private System.Void set_isPropagationStopped(System.Boolean value)
    // Offset: 0xD4284C
    void set_isPropagationStopped(bool value);
    // public System.Void StopPropagation()
    // Offset: 0xD3FEA8
    void StopPropagation();
    // public System.Boolean get_isImmediatePropagationStopped()
    // Offset: 0xD42868
    bool get_isImmediatePropagationStopped();
    // private System.Void set_isImmediatePropagationStopped(System.Boolean value)
    // Offset: 0xD42874
    void set_isImmediatePropagationStopped(bool value);
    // public System.Void StopImmediatePropagation()
    // Offset: 0xD42890
    void StopImmediatePropagation();
    // public System.Boolean get_isDefaultPrevented()
    // Offset: 0xD3F934
    bool get_isDefaultPrevented();
    // private System.Void set_isDefaultPrevented(System.Boolean value)
    // Offset: 0xD428A0
    void set_isDefaultPrevented(bool value);
    // public System.Void PreventDefault()
    // Offset: 0xD3FEB8
    void PreventDefault();
    // public UnityEngine.UIElements.PropagationPhase get_propagationPhase()
    // Offset: 0xD428BC
    ::UnityEngine::UIElements::PropagationPhase get_propagationPhase();
    // System.Void set_propagationPhase(UnityEngine.UIElements.PropagationPhase value)
    // Offset: 0xD428C4
    void set_propagationPhase(::UnityEngine::UIElements::PropagationPhase value);
    // public UnityEngine.UIElements.IEventHandler get_currentTarget()
    // Offset: 0xD428CC
    ::UnityEngine::UIElements::IEventHandler* get_currentTarget();
    // System.Void set_currentTarget(UnityEngine.UIElements.IEventHandler value)
    // Offset: 0xD428D4
    void set_currentTarget(::UnityEngine::UIElements::IEventHandler* value);
    // public System.Boolean get_dispatch()
    // Offset: 0xD429E4
    bool get_dispatch();
    // System.Void set_dispatch(System.Boolean value)
    // Offset: 0xD429F0
    void set_dispatch(bool value);
    // System.Void MarkReceivedByDispatcher()
    // Offset: 0xD42A2C
    void MarkReceivedByDispatcher();
    // private System.Boolean get_dispatched()
    // Offset: 0xD42AB8
    bool get_dispatched();
    // private System.Void set_dispatched(System.Boolean value)
    // Offset: 0xD42A10
    void set_dispatched(bool value);
    // System.Boolean get_processed()
    // Offset: 0xD42AC4
    bool get_processed();
    // private System.Void set_processed(System.Boolean value)
    // Offset: 0xD42818
    void set_processed(bool value);
    // System.Boolean get_stopDispatch()
    // Offset: 0xD42AD0
    bool get_stopDispatch();
    // System.Void set_stopDispatch(System.Boolean value)
    // Offset: 0xD40834
    void set_stopDispatch(bool value);
    // System.Boolean get_propagateToIMGUI()
    // Offset: 0xD3FED0
    bool get_propagateToIMGUI();
    // System.Void set_propagateToIMGUI(System.Boolean value)
    // Offset: 0xD40818
    void set_propagateToIMGUI(bool value);
    // private System.Boolean get_imguiEventIsValid()
    // Offset: 0xD42ADC
    bool get_imguiEventIsValid();
    // private System.Void set_imguiEventIsValid(System.Boolean value)
    // Offset: 0xD42AE8
    void set_imguiEventIsValid(bool value);
    // public UnityEngine.Event get_imguiEvent()
    // Offset: 0xD429CC
    ::UnityEngine::Event* get_imguiEvent();
    // protected System.Void set_imguiEvent(UnityEngine.Event value)
    // Offset: 0xD42B04
    void set_imguiEvent(::UnityEngine::Event* value);
    // public UnityEngine.Vector2 get_originalMousePosition()
    // Offset: 0xD42BC4
    ::UnityEngine::Vector2 get_originalMousePosition();
    // private System.Void set_originalMousePosition(UnityEngine.Vector2 value)
    // Offset: 0xD42BCC
    void set_originalMousePosition(::UnityEngine::Vector2 value);
    // protected System.Void Init()
    // Offset: 0xD42BD4
    void Init();
    // private System.Void LocalInit()
    // Offset: 0xD42BD8
    void LocalInit();
    // protected System.Void .ctor()
    // Offset: 0xD42DD0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EventBase* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::EventBase::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EventBase*, creationType>()));
    }
    // protected System.Boolean get_pooled()
    // Offset: 0xD42E4C
    bool get_pooled();
    // protected System.Void set_pooled(System.Boolean value)
    // Offset: 0xD42DB4
    void set_pooled(bool value);
    // System.Void Acquire()
    // Offset: 0xFFFFFFFFFFFFFFFF
    void Acquire();
    // public System.Void Dispose()
    // Offset: 0xFFFFFFFFFFFFFFFF
    void Dispose();
    // static private System.Void .cctor()
    // Offset: 0xD42E58
    static void _cctor();
  }; // UnityEngine.UIElements.EventBase
  #pragma pack(pop)
  static check_size<sizeof(EventBase), 112 + sizeof(::UnityEngine::Vector2)> __UnityEngine_UIElements_EventBaseSizeCheck;
  static_assert(sizeof(EventBase) == 0x78);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::EventBase::LifeCycleStatus, "UnityEngine.UIElements", "EventBase/LifeCycleStatus");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::EventBase::EventPropagation, "UnityEngine.UIElements", "EventBase/EventPropagation");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::EventBase::RegisterEventType
// Il2CppName: RegisterEventType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int64_t (*)()>(&UnityEngine::UIElements::EventBase::RegisterEventType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::EventBase*), "RegisterEventType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
