// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseController
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseController.hpp"
// Including type: UnityEngine.XR.XRNode
#include "UnityEngine/XR/XRNode.hpp"
// Including type: InputHelpers/Button
#include "GlobalNamespace/InputHelpers_Button.hpp"
// Including type: UnityEngine.XR.InputDevice
#include "UnityEngine/XR/InputDevice.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Experimental::XR::Interaction
namespace UnityEngine::Experimental::XR::Interaction {
  // Forward declaring type: BasePoseProvider
  class BasePoseProvider;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Skipping declaration: InteractionState because it is already included!
  // Forward declaring type: XRControllerState
  class XRControllerState;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRController
  class XRController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRController*, "UnityEngine.XR.Interaction.Toolkit", "XRController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0xA9
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRController
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: ADD758
  class XRController : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseController {
    public:
    // Writing base type padding for base size: 0x71 to desired offset: 0x74
    char ___base_padding[0x3] = {};
    public:
    // [TooltipAttribute] Offset: 0xADE360
    // private UnityEngine.XR.XRNode m_ControllerNode
    // Size: 0x4
    // Offset: 0x74
    ::UnityEngine::XR::XRNode m_ControllerNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::XRNode) == 0x4);
    // [TooltipAttribute] Offset: 0xADE3AC
    // private InputHelpers/Button m_SelectUsage
    // Size: 0x4
    // Offset: 0x78
    ::GlobalNamespace::InputHelpers::Button m_SelectUsage;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE3F8
    // private InputHelpers/Button m_ActivateUsage
    // Size: 0x4
    // Offset: 0x7C
    ::GlobalNamespace::InputHelpers::Button m_ActivateUsage;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE444
    // private InputHelpers/Button m_UIPressUsage
    // Size: 0x4
    // Offset: 0x80
    ::GlobalNamespace::InputHelpers::Button m_UIPressUsage;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE490
    // private System.Single m_AxisToPressThreshold
    // Size: 0x4
    // Offset: 0x84
    float m_AxisToPressThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADE4DC
    // private InputHelpers/Button m_RotateAnchorLeft
    // Size: 0x4
    // Offset: 0x88
    ::GlobalNamespace::InputHelpers::Button m_RotateAnchorLeft;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE528
    // private InputHelpers/Button m_RotateAnchorRight
    // Size: 0x4
    // Offset: 0x8C
    ::GlobalNamespace::InputHelpers::Button m_RotateAnchorRight;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE574
    // private InputHelpers/Button m_MoveObjectIn
    // Size: 0x4
    // Offset: 0x90
    ::GlobalNamespace::InputHelpers::Button m_MoveObjectIn;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE5C0
    // private InputHelpers/Button m_MoveObjectOut
    // Size: 0x4
    // Offset: 0x94
    ::GlobalNamespace::InputHelpers::Button m_MoveObjectOut;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InputHelpers::Button) == 0x4);
    // [TooltipAttribute] Offset: 0xADE60C
    // private UnityEngine.Experimental.XR.Interaction.BasePoseProvider m_PoseProvider
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Experimental::XR::Interaction::BasePoseProvider* m_PoseProvider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::XR::Interaction::BasePoseProvider*) == 0x8);
    // private UnityEngine.XR.InputDevice m_InputDevice
    // Size: 0x9
    // Offset: 0xA0
    ::UnityEngine::XR::InputDevice m_InputDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    public:
    // Get instance field reference: private UnityEngine.XR.XRNode m_ControllerNode
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::XRNode& dyn_m_ControllerNode();
    // Get instance field reference: private InputHelpers/Button m_SelectUsage
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::InputHelpers::Button& dyn_m_SelectUsage();
    // Get instance field reference: private InputHelpers/Button m_ActivateUsage
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::InputHelpers::Button& dyn_m_ActivateUsage();
    // Get instance field reference: private InputHelpers/Button m_UIPressUsage
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::InputHelpers::Button& dyn_m_UIPressUsage();
