// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: CheckoutCartButton
  class CheckoutCartButton;
  // Forward declaring type: EarlyAccessButton
  class EarlyAccessButton;
  // Forward declaring type: PurchaseCurrencyButton
  class PurchaseCurrencyButton;
  // Forward declaring type: FittingRoomButton
  class FittingRoomButton;
  // Forward declaring type: CosmeticStand
  class CosmeticStand;
  // Forward declaring type: PurchaseItemButton
  class PurchaseItemButton;
  // Forward declaring type: HeadModel
  class HeadModel;
  // Forward declaring type: WardrobeItemButton
  class WardrobeItemButton;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaComputer
  class GorillaComputer;
  // Skipping declaration: CosmeticItem because it is already included!
  // Skipping declaration: CosmeticSet because it is already included!
  // Skipping declaration: ATMStages because it is already included!
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: CatalogItem
  class CatalogItem;
  // Forward declaring type: UserDataRecord
  class UserDataRecord;
  // Forward declaring type: PurchaseItemResult
  class PurchaseItemResult;
  // Forward declaring type: GetUserDataResult
  class GetUserDataResult;
  // Forward declaring type: ExecuteCloudScriptResult
  class ExecuteCloudScriptResult;
  // Forward declaring type: GetUserInventoryResult
  class GetUserInventoryResult;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message
  class Message;
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: Purchase
  class Purchase;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: CosmeticsController
  class CosmeticsController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::CosmeticsController);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::CosmeticsController*, "GorillaNetworking", "CosmeticsController");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x540
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.CosmeticsController
  // [TokenAttribute] Offset: FFFFFFFF
  class CosmeticsController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaNetworking::CosmeticsController::PurchaseItemStages
    struct PurchaseItemStages;
    // Nested type: ::GorillaNetworking::CosmeticsController::Wardrobe
    struct Wardrobe;
    // Nested type: ::GorillaNetworking::CosmeticsController::ATMStages
    struct ATMStages;
    // Nested type: ::GorillaNetworking::CosmeticsController::CosmeticSet
    struct CosmeticSet;
    // Nested type: ::GorillaNetworking::CosmeticsController::CosmeticItem
    struct CosmeticItem;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass102_0
    class $$c__DisplayClass102_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass103_0
    class $$c__DisplayClass103_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckIfMyCosmeticsUpdated$d__103
    class $CheckIfMyCosmeticsUpdated$d__103;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass112_0
    class $$c__DisplayClass112_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass113_0
    class $$c__DisplayClass113_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c
    class $$c;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckCanGetDaily$d__114
    class $CheckCanGetDaily$d__114;
    // Nested type: ::GorillaNetworking::CosmeticsController::$GetMyDaily$d__115
    class $GetMyDaily$d__115;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_0
    class $$c__DisplayClass116_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_1
    class $$c__DisplayClass116_1;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_2
    class $$c__DisplayClass116_2;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass116_3
    class $$c__DisplayClass116_3;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckIfQuitPurchase$d__124
    class $CheckIfQuitPurchase$d__124;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.CosmeticsController/PurchaseItemStages
    // [TokenAttribute] Offset: FFFFFFFF
    struct PurchaseItemStages/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PurchaseItemStages
      constexpr PurchaseItemStages(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Start
      static constexpr const int Start = 0;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Start
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Start();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Start
      static void _set_Start(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages CheckoutButtonPressed
      static constexpr const int CheckoutButtonPressed = 1;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages CheckoutButtonPressed
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_CheckoutButtonPressed();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages CheckoutButtonPressed
      static void _set_CheckoutButtonPressed(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemSelected
      static constexpr const int ItemSelected = 2;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemSelected
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_ItemSelected();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemSelected
      static void _set_ItemSelected(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemOwned
      static constexpr const int ItemOwned = 3;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemOwned
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_ItemOwned();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemOwned
      static void _set_ItemOwned(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages FinalPurchaseAcknowledgement
      static constexpr const int FinalPurchaseAcknowledgement = 4;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages FinalPurchaseAcknowledgement
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_FinalPurchaseAcknowledgement();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages FinalPurchaseAcknowledgement
      static void _set_FinalPurchaseAcknowledgement(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Buying
      static constexpr const int Buying = 5;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Buying
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Buying();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Buying
      static void _set_Buying(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Success
      static constexpr const int Success = 6;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Success
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Success();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Success
      static void _set_Success(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Failure
      static constexpr const int Failure = 7;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Failure
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Failure();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Failure
      static void _set_Failure(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.CosmeticsController/PurchaseItemStages
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::PurchaseItemStages), 0 + sizeof(int)> __GorillaNetworking_CosmeticsController_PurchaseItemStagesSizeCheck;
    static_assert(sizeof(CosmeticsController::PurchaseItemStages) == 0x4);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaNetworking.CosmeticsController/Wardrobe
    // [TokenAttribute] Offset: FFFFFFFF
    struct Wardrobe/*, public ::System::ValueType*/ {
      public:
      public:
      // public WardrobeItemButton[] wardrobeItemButtons
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<::GlobalNamespace::WardrobeItemButton*> wardrobeItemButtons;
      // Field size check
      static_assert(sizeof(::ArrayW<::GlobalNamespace::WardrobeItemButton*>) == 0x8);
      // public HeadModel selfDoll
      // Size: 0x8
      // Offset: 0x8
      ::GlobalNamespace::HeadModel* selfDoll;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::HeadModel*) == 0x8);
      public:
      // Creating value type constructor for type: Wardrobe
      constexpr Wardrobe(::ArrayW<::GlobalNamespace::WardrobeItemButton*> wardrobeItemButtons_ = ::ArrayW<::GlobalNamespace::WardrobeItemButton*>(static_cast<void*>(nullptr)), ::GlobalNamespace::HeadModel* selfDoll_ = {}) noexcept : wardrobeItemButtons{wardrobeItemButtons_}, selfDoll{selfDoll_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public WardrobeItemButton[] wardrobeItemButtons
      [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::WardrobeItemButton*>& dyn_wardrobeItemButtons();
      // Get instance field reference: public HeadModel selfDoll
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::HeadModel*& dyn_selfDoll();
    }; // GorillaNetworking.CosmeticsController/Wardrobe
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::Wardrobe), 8 + sizeof(::GlobalNamespace::HeadModel*)> __GorillaNetworking_CosmeticsController_WardrobeSizeCheck;
    static_assert(sizeof(CosmeticsController::Wardrobe) == 0x10);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.CosmeticsController/ATMStages
    // [TokenAttribute] Offset: FFFFFFFF
    struct ATMStages/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ATMStages
      constexpr ATMStages(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Unavailable
      static constexpr const int Unavailable = 0;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Unavailable
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Unavailable();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Unavailable
      static void _set_Unavailable(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Begin
      static constexpr const int Begin = 1;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Begin
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Begin();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Begin
      static void _set_Begin(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Menu
      static constexpr const int Menu = 2;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Menu
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Menu();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Menu
      static void _set_Menu(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Balance
      static constexpr const int Balance = 3;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Balance
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Balance();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Balance
      static void _set_Balance(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Choose
      static constexpr const int Choose = 4;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Choose
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Choose();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Choose
      static void _set_Choose(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Confirm
      static constexpr const int Confirm = 5;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Confirm
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Confirm();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Confirm
      static void _set_Confirm(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Purchasing
      static constexpr const int Purchasing = 6;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Purchasing
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Purchasing();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Purchasing
      static void _set_Purchasing(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Success
      static constexpr const int Success = 7;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Success
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Success();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Success
      static void _set_Success(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Failure
      static constexpr const int Failure = 8;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Failure
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Failure();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Failure
      static void _set_Failure(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Locked
      static constexpr const int Locked = 9;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Locked
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Locked();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Locked
      static void _set_Locked(::GorillaNetworking::CosmeticsController::ATMStages value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.CosmeticsController/ATMStages
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::ATMStages), 0 + sizeof(int)> __GorillaNetworking_CosmeticsController_ATMStagesSizeCheck;
    static_assert(sizeof(CosmeticsController::ATMStages) == 0x4);
    // Size: 0x112
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaNetworking.CosmeticsController/CosmeticSet
    // [TokenAttribute] Offset: FFFFFFFF
    struct CosmeticSet/*, public ::System::ValueType*/ {
      public:
      public:
      // public GorillaNetworking.CosmeticsController/CosmeticItem hat
      // Size: 0x32
      // Offset: 0x0
      ::GorillaNetworking::CosmeticsController::CosmeticItem hat;
      // Field size check
      static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
      // Padding between fields: hat and: badge
      char __padding0[0x6] = {};
      // public GorillaNetworking.CosmeticsController/CosmeticItem badge
      // Size: 0x32
      // Offset: 0x38
      ::GorillaNetworking::CosmeticsController::CosmeticItem badge;
      // Field size check
      static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
      // Padding between fields: badge and: face
      char __padding1[0x6] = {};
      // public GorillaNetworking.CosmeticsController/CosmeticItem face
      // Size: 0x32
      // Offset: 0x70
      ::GorillaNetworking::CosmeticsController::CosmeticItem face;
      // Field size check
      static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
      // Padding between fields: face and: leftHandHold
      char __padding2[0x6] = {};
      // public GorillaNetworking.CosmeticsController/CosmeticItem leftHandHold
      // Size: 0x32
      // Offset: 0xA8
      ::GorillaNetworking::CosmeticsController::CosmeticItem leftHandHold;
      // Field size check
      static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
      // Padding between fields: leftHandHold and: rightHandHold
      char __padding3[0x6] = {};
      // public GorillaNetworking.CosmeticsController/CosmeticItem rightHandHold
      // Size: 0x32
      // Offset: 0xE0
      ::GorillaNetworking::CosmeticsController::CosmeticItem rightHandHold;
      // Field size check
      static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
      public:
      // Creating value type constructor for type: CosmeticSet
      constexpr CosmeticSet(::GorillaNetworking::CosmeticsController::CosmeticItem hat_ = {}, ::GorillaNetworking::CosmeticsController::CosmeticItem badge_ = {}, ::GorillaNetworking::CosmeticsController::CosmeticItem face_ = {}, ::GorillaNetworking::CosmeticsController::CosmeticItem leftHandHold_ = {}, ::GorillaNetworking::CosmeticsController::CosmeticItem rightHandHold_ = {}) noexcept : hat{hat_}, badge{badge_}, face{face_}, leftHandHold{leftHandHold_}, rightHandHold{rightHandHold_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public GorillaNetworking.CosmeticsController/CosmeticItem hat
      [[deprecated("Use field access instead!")]] ::GorillaNetworking::CosmeticsController::CosmeticItem& dyn_hat();
      // Get instance field reference: public GorillaNetworking.CosmeticsController/CosmeticItem badge
      [[deprecated("Use field access instead!")]] ::GorillaNetworking::CosmeticsController::CosmeticItem& dyn_badge();
      // Get instance field reference: public GorillaNetworking.CosmeticsController/CosmeticItem face
      [[deprecated("Use field access instead!")]] ::GorillaNetworking::CosmeticsController::CosmeticItem& dyn_face();
      // Get instance field reference: public GorillaNetworking.CosmeticsController/CosmeticItem leftHandHold
      [[deprecated("Use field access instead!")]] ::GorillaNetworking::CosmeticsController::CosmeticItem& dyn_leftHandHold();
      // Get instance field reference: public GorillaNetworking.CosmeticsController/CosmeticItem rightHandHold
      [[deprecated("Use field access instead!")]] ::GorillaNetworking::CosmeticsController::CosmeticItem& dyn_rightHandHold();
    }; // GorillaNetworking.CosmeticsController/CosmeticSet
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::CosmeticSet), 224 + sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem)> __GorillaNetworking_CosmeticsController_CosmeticSetSizeCheck;
    static_assert(sizeof(CosmeticsController::CosmeticSet) == 0x112);
    // Size: 0x32
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaNetworking.CosmeticsController/CosmeticItem
    // [TokenAttribute] Offset: FFFFFFFF
    struct CosmeticItem/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String itemName
      // Size: 0x8
      // Offset: 0x0
      ::StringW itemName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String itemSlot
      // Size: 0x8
      // Offset: 0x8
      ::StringW itemSlot;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public UnityEngine.Sprite itemPicture
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Sprite* itemPicture;
      // Field size check
      static_assert(sizeof(::UnityEngine::Sprite*) == 0x8);
      // public System.String displayName
      // Size: 0x8
      // Offset: 0x18
      ::StringW displayName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Int32 cost
      // Size: 0x4
      // Offset: 0x20
      int cost;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: cost and: bundledItems
      char __padding4[0x4] = {};
      // public System.String[] bundledItems
      // Size: 0x8
      // Offset: 0x28
      ::ArrayW<::StringW> bundledItems;
      // Field size check
      static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
      // public System.Boolean canTryOn
      // Size: 0x1
      // Offset: 0x30
      bool canTryOn;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean bothHandsHoldable
      // Size: 0x1
      // Offset: 0x31
      bool bothHandsHoldable;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: CosmeticItem
      constexpr CosmeticItem(::StringW itemName_ = {}, ::StringW itemSlot_ = {}, ::UnityEngine::Sprite* itemPicture_ = {}, ::StringW displayName_ = {}, int cost_ = {}, ::ArrayW<::StringW> bundledItems_ = ::ArrayW<::StringW>(static_cast<void*>(nullptr)), bool canTryOn_ = {}, bool bothHandsHoldable_ = {}) noexcept : itemName{itemName_}, itemSlot{itemSlot_}, itemPicture{itemPicture_}, displayName{displayName_}, cost{cost_}, bundledItems{bundledItems_}, canTryOn{canTryOn_}, bothHandsHoldable{bothHandsHoldable_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String itemName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_itemName();
      // Get instance field reference: public System.String itemSlot
      [[deprecated("Use field access instead!")]] ::StringW& dyn_itemSlot();
      // Get instance field reference: public UnityEngine.Sprite itemPicture
      [[deprecated("Use field access instead!")]] ::UnityEngine::Sprite*& dyn_itemPicture();
      // Get instance field reference: public System.String displayName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_displayName();
      // Get instance field reference: public System.Int32 cost
      [[deprecated("Use field access instead!")]] int& dyn_cost();
      // Get instance field reference: public System.String[] bundledItems
      [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_bundledItems();
      // Get instance field reference: public System.Boolean canTryOn
      [[deprecated("Use field access instead!")]] bool& dyn_canTryOn();
      // Get instance field reference: public System.Boolean bothHandsHoldable
      [[deprecated("Use field access instead!")]] bool& dyn_bothHandsHoldable();
    }; // GorillaNetworking.CosmeticsController/CosmeticItem
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::CosmeticItem), 49 + sizeof(bool)> __GorillaNetworking_CosmeticsController_CosmeticItemSizeCheck;
    static_assert(sizeof(CosmeticsController::CosmeticItem) == 0x32);
    public:
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> allCosmetics
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* allCosmetics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,GorillaNetworking.CosmeticsController/CosmeticItem> allCosmeticsDict
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaNetworking::CosmeticsController::CosmeticItem>* allCosmeticsDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.String> allCosmeticsItemIDsfromDisplayNamesDict
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* allCosmeticsItemIDsfromDisplayNamesDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticItem nullItem
    // Size: 0x32
    // Offset: 0x30
    ::GorillaNetworking::CosmeticsController::CosmeticItem nullItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
    // Padding between fields: nullItem and: catalog
    char __padding3[0x6] = {};
    // public System.String catalog
    // Size: 0x8
    // Offset: 0x68
    ::StringW catalog;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public GorillaNetworking.GorillaComputer computer
    // Size: 0x8
    // Offset: 0x70
    ::GorillaNetworking::GorillaComputer* computer;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaComputer*) == 0x8);
    // private System.String[] tempStringArray
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::StringW> tempStringArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private GorillaNetworking.CosmeticsController/CosmeticItem tempItem
    // Size: 0x32
    // Offset: 0x80
    ::GorillaNetworking::CosmeticsController::CosmeticItem tempItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
    // Padding between fields: tempItem and: catalogItems
    char __padding7[0x6] = {};
    // public System.Collections.Generic.List`1<PlayFab.ClientModels.CatalogItem> catalogItems
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::PlayFab::ClientModels::CatalogItem*>* catalogItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::ClientModels::CatalogItem*>*) == 0x8);
    // public System.Boolean tryTwice
    // Size: 0x1
    // Offset: 0xC0
    bool tryTwice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryTwice and: tryOnSet
    char __padding9[0x7] = {};
    // public GorillaNetworking.CosmeticsController/CosmeticSet tryOnSet
    // Size: 0x112
    // Offset: 0xC8
    ::GorillaNetworking::CosmeticsController::CosmeticSet tryOnSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet) == 0x112);
    // Padding between fields: tryOnSet and: fittingRoomButtons
    char __padding10[0x6] = {};
    // public FittingRoomButton[] fittingRoomButtons
    // Size: 0x8
    // Offset: 0x1E0
    ::ArrayW<::GlobalNamespace::FittingRoomButton*> fittingRoomButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::FittingRoomButton*>) == 0x8);
    // public CosmeticStand[] cosmeticStands
    // Size: 0x8
    // Offset: 0x1E8
    ::ArrayW<::GlobalNamespace::CosmeticStand*> cosmeticStands;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::CosmeticStand*>) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> currentCart
    // Size: 0x8
    // Offset: 0x1F0
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* currentCart;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public GorillaNetworking.CosmeticsController/PurchaseItemStages currentPurchaseItemStage
    // Size: 0x4
    // Offset: 0x1F8
    ::GorillaNetworking::CosmeticsController::PurchaseItemStages currentPurchaseItemStage;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::PurchaseItemStages) == 0x4);
    // Padding between fields: currentPurchaseItemStage and: checkoutCartButtons
    char __padding14[0x4] = {};
    // public CheckoutCartButton[] checkoutCartButtons
    // Size: 0x8
    // Offset: 0x200
    ::ArrayW<::GlobalNamespace::CheckoutCartButton*> checkoutCartButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::CheckoutCartButton*>) == 0x8);
    // public PurchaseItemButton leftPurchaseButton
    // Size: 0x8
    // Offset: 0x208
    ::GlobalNamespace::PurchaseItemButton* leftPurchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PurchaseItemButton*) == 0x8);
    // public PurchaseItemButton rightPurchaseButton
    // Size: 0x8
    // Offset: 0x210
    ::GlobalNamespace::PurchaseItemButton* rightPurchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PurchaseItemButton*) == 0x8);
    // public UnityEngine.UI.Text purchaseText
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::UI::Text* purchaseText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticItem itemToBuy
    // Size: 0x32
    // Offset: 0x220
    ::GorillaNetworking::CosmeticsController::CosmeticItem itemToBuy;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
    // Padding between fields: itemToBuy and: checkoutHeadModel
    char __padding19[0x6] = {};
    // public HeadModel checkoutHeadModel
    // Size: 0x8
    // Offset: 0x258
    ::GlobalNamespace::HeadModel* checkoutHeadModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HeadModel*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> playerIDList
    // Size: 0x8
    // Offset: 0x260
    ::System::Collections::Generic::List_1<::StringW>* playerIDList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Boolean foundCosmetic
    // Size: 0x1
    // Offset: 0x268
    bool foundCosmetic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: foundCosmetic and: attempts
    char __padding22[0x3] = {};
    // private System.Int32 attempts
    // Size: 0x4
    // Offset: 0x26C
    int attempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String finalLine
    // Size: 0x8
    // Offset: 0x270
    ::StringW finalLine;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean purchaseLocked
    // Size: 0x1
    // Offset: 0x278
    bool purchaseLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isLastHandTouchedLeft
    // Size: 0x1
    // Offset: 0x279
    bool isLastHandTouchedLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLastHandTouchedLeft and: wardrobes
    char __padding26[0x6] = {};
    // public GorillaNetworking.CosmeticsController/Wardrobe[] wardrobes
    // Size: 0x8
    // Offset: 0x280
    ::ArrayW<::GorillaNetworking::CosmeticsController::Wardrobe> wardrobes;
    // Field size check
    static_assert(sizeof(::ArrayW<::GorillaNetworking::CosmeticsController::Wardrobe>) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> unlockedCosmetics
    // Size: 0x8
    // Offset: 0x288
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* unlockedCosmetics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> unlockedHats
    // Size: 0x8
    // Offset: 0x290
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* unlockedHats;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> unlockedFaces
    // Size: 0x8
    // Offset: 0x298
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* unlockedFaces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> unlockedBadges
    // Size: 0x8
    // Offset: 0x2A0
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* unlockedBadges;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> unlockedHoldable
    // Size: 0x8
    // Offset: 0x2A8
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* unlockedHoldable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public System.Int32[] cosmeticsPages
    // Size: 0x8
    // Offset: 0x2B0
    ::ArrayW<int> cosmeticsPages;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem>[] itemLists
    // Size: 0x8
    // Offset: 0x2B8
    ::ArrayW<::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*> itemLists;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*>) == 0x8);
    // private System.Int32 wardrobeType
    // Size: 0x4
    // Offset: 0x2C0
    int wardrobeType;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: wardrobeType and: currentWornSet
    char __padding35[0x4] = {};
    // public GorillaNetworking.CosmeticsController/CosmeticSet currentWornSet
    // Size: 0x112
    // Offset: 0x2C8
    ::GorillaNetworking::CosmeticsController::CosmeticSet currentWornSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet) == 0x112);
    // Padding between fields: currentWornSet and: concatStringCosmeticsAllowed
    char __padding36[0x6] = {};
    // public System.String concatStringCosmeticsAllowed
    // Size: 0x8
    // Offset: 0x3E0
    ::StringW concatStringCosmeticsAllowed;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.UI.Text atmText
    // Size: 0x8
    // Offset: 0x3E8
    ::UnityEngine::UI::Text* atmText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String currentAtmString
    // Size: 0x8
    // Offset: 0x3F0
    ::StringW currentAtmString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.UI.Text infoText
    // Size: 0x8
    // Offset: 0x3F8
    ::UnityEngine::UI::Text* infoText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text earlyAccessText
    // Size: 0x8
    // Offset: 0x400
    ::UnityEngine::UI::Text* earlyAccessText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text[] purchaseButtonText
    // Size: 0x8
    // Offset: 0x408
    ::ArrayW<::UnityEngine::UI::Text*> purchaseButtonText;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UI::Text*>) == 0x8);
    // public UnityEngine.UI.Text dailyText
    // Size: 0x8
    // Offset: 0x410
    ::UnityEngine::UI::Text* dailyText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public GorillaNetworking.CosmeticsController/ATMStages currentATMStage
    // Size: 0x4
    // Offset: 0x418
    ::GorillaNetworking::CosmeticsController::ATMStages currentATMStage;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::ATMStages) == 0x4);
    // Padding between fields: currentATMStage and: atmButtonsText
    char __padding44[0x4] = {};
    // public UnityEngine.UI.Text atmButtonsText
    // Size: 0x8
    // Offset: 0x420
    ::UnityEngine::UI::Text* atmButtonsText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.Int32 currencyBalance
    // Size: 0x4
    // Offset: 0x428
    int currencyBalance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: currencyBalance and: currencyName
    char __padding46[0x4] = {};
    // public System.String currencyName
    // Size: 0x8
    // Offset: 0x430
    ::StringW currencyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PurchaseCurrencyButton[] purchaseCurrencyButtons
    // Size: 0x8
    // Offset: 0x438
    ::ArrayW<::GlobalNamespace::PurchaseCurrencyButton*> purchaseCurrencyButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::PurchaseCurrencyButton*>) == 0x8);
    // public UnityEngine.UI.Text currencyBoardText
    // Size: 0x8
    // Offset: 0x440
    ::UnityEngine::UI::Text* currencyBoardText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text currencyBoxText
    // Size: 0x8
    // Offset: 0x448
    ::UnityEngine::UI::Text* currencyBoxText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String startingCurrencyBoxTextString
    // Size: 0x8
    // Offset: 0x450
    ::StringW startingCurrencyBoxTextString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String successfulCurrencyPurchaseTextString
    // Size: 0x8
    // Offset: 0x458
    ::StringW successfulCurrencyPurchaseTextString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 numShinyRocksToBuy
    // Size: 0x4
    // Offset: 0x460
    int numShinyRocksToBuy;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single shinyRocksCost
    // Size: 0x4
    // Offset: 0x464
    float shinyRocksCost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.String itemToPurchase
    // Size: 0x8
    // Offset: 0x468
    ::StringW itemToPurchase;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean confirmedDidntPlayInBeta
    // Size: 0x1
    // Offset: 0x470
    bool confirmedDidntPlayInBeta;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean playedInBeta
    // Size: 0x1
    // Offset: 0x471
    bool playedInBeta;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean gotMyDaily
    // Size: 0x1
    // Offset: 0x472
    bool gotMyDaily;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean checkedDaily
    // Size: 0x1
    // Offset: 0x473
    bool checkedDaily;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkedDaily and: currentPurchaseID
    char __padding59[0x4] = {};
    // public System.String currentPurchaseID
    // Size: 0x8
    // Offset: 0x478
    ::StringW currentPurchaseID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean hasPrice
    // Size: 0x1
    // Offset: 0x480
    bool hasPrice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasPrice and: searchIndex
    char __padding61[0x3] = {};
    // private System.Int32 searchIndex
    // Size: 0x4
    // Offset: 0x484
    int searchIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iterator
    // Size: 0x4
    // Offset: 0x488
    int iterator;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: iterator and: cosmeticItemVar
    char __padding63[0x4] = {};
    // private GorillaNetworking.CosmeticsController/CosmeticItem cosmeticItemVar
    // Size: 0x32
    // Offset: 0x490
    ::GorillaNetworking::CosmeticsController::CosmeticItem cosmeticItemVar;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x32);
    // Padding between fields: cosmeticItemVar and: earlyAccessButton
    char __padding64[0x6] = {};
    // public EarlyAccessButton earlyAccessButton
    // Size: 0x8
    // Offset: 0x4C8
    ::GlobalNamespace::EarlyAccessButton* earlyAccessButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EarlyAccessButton*) == 0x8);
    // private System.String userToken
    // Size: 0x8
    // Offset: 0x4D0
    ::StringW userToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean triggerAPI
    // Size: 0x1
    // Offset: 0x4D8
    bool triggerAPI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: triggerAPI and: cloudscriptAttempts
    char __padding67[0x3] = {};
    // public System.Int32 cloudscriptAttempts
    // Size: 0x4
    // Offset: 0x4DC
    int cloudscriptAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 userLockAttempts
    // Size: 0x4
    // Offset: 0x4E0
    int userLockAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 attemptsLimit
    // Size: 0x4
    // Offset: 0x4E4
    int attemptsLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean tryGetPurchasesTwice
    // Size: 0x1
    // Offset: 0x4E8
    bool tryGetPurchasesTwice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryGetPurchasesTwice and: startupSKU
    char __padding71[0x7] = {};
    // public System.String startupSKU
    // Size: 0x8
    // Offset: 0x4F0
    ::StringW startupSKU;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 startupAttempts
    // Size: 0x4
    // Offset: 0x4F8
    int startupAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean oculusAttemptingToPurchase
    // Size: 0x1
    // Offset: 0x4FC
    bool oculusAttemptingToPurchase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: oculusAttemptingToPurchase and: debugParameters
    char __padding74[0x3] = {};
    // public System.Boolean[] debugParameters
    // Size: 0x8
    // Offset: 0x500
    ::ArrayW<bool> debugParameters;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // public System.Boolean hasLockableItem
    // Size: 0x1
    // Offset: 0x508
    bool hasLockableItem;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLockableItem and: currentTime
    char __padding76[0x7] = {};
    // public System.DateTime currentTime
    // Size: 0x8
    // Offset: 0x510
    ::System::DateTime currentTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.String lastDailyLogin
    // Size: 0x8
    // Offset: 0x518
    ::StringW lastDailyLogin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PlayFab.ClientModels.UserDataRecord userDataRecord
    // Size: 0x8
    // Offset: 0x520
    ::PlayFab::ClientModels::UserDataRecord* userDataRecord;
    // Field size check
    static_assert(sizeof(::PlayFab::ClientModels::UserDataRecord*) == 0x8);
    // public System.Int32 secondsUntilTomorrow
    // Size: 0x4
    // Offset: 0x528
    int secondsUntilTomorrow;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single secondsToWaitToCheckDaily
    // Size: 0x4
    // Offset: 0x52C
    float secondsToWaitToCheckDaily;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String returnString
    // Size: 0x8
    // Offset: 0x530
    ::StringW returnString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] returnStringArray
    // Size: 0x8
    // Offset: 0x538
    ::ArrayW<::StringW> returnStringArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public GorillaNetworking.CosmeticsController instance
    static ::GorillaNetworking::CosmeticsController* _get_instance();
    // Set static field: static public GorillaNetworking.CosmeticsController instance
    static void _set_instance(::GorillaNetworking::CosmeticsController* value);
    // Get instance field reference: public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> allCosmetics
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*& dyn_allCosmetics();
