// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: TrafficStats
  class TrafficStats;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExitGames::Client::Photon::TrafficStats);
DEFINE_IL2CPP_ARG_TYPE(::ExitGames::Client::Photon::TrafficStats*, "ExitGames.Client.Photon", "TrafficStats");
// Type namespace: ExitGames.Client.Photon
namespace ExitGames::Client::Photon {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: ExitGames.Client.Photon.TrafficStats
  // [TokenAttribute] Offset: FFFFFFFF
  class TrafficStats : public ::Il2CppObject {
    public:
    public:
    // [DebuggerBrowsableAttribute] Offset: 0xAACE4C
    // [CompilerGeneratedAttribute] Offset: 0xAACE4C
    // private System.Int32 <PackageHeaderSize>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    int PackageHeaderSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAACE88
    // [DebuggerBrowsableAttribute] Offset: 0xAACE88
    // private System.Int32 <ReliableCommandCount>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    int ReliableCommandCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0xAACEC4
    // [CompilerGeneratedAttribute] Offset: 0xAACEC4
    // private System.Int32 <UnreliableCommandCount>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int UnreliableCommandCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAACF00
    // [DebuggerBrowsableAttribute] Offset: 0xAACF00
    // private System.Int32 <FragmentCommandCount>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    int FragmentCommandCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0xAACF3C
    // [CompilerGeneratedAttribute] Offset: 0xAACF3C
    // private System.Int32 <ControlCommandCount>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    int ControlCommandCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0xAACF78
    // [CompilerGeneratedAttribute] Offset: 0xAACF78
    // private System.Int32 <TotalPacketCount>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int TotalPacketCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [DebuggerBrowsableAttribute] Offset: 0xAACFB4
    // [CompilerGeneratedAttribute] Offset: 0xAACFB4
    // private System.Int32 <TotalCommandsInPackets>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int TotalCommandsInPackets;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAACFF0
    // [DebuggerBrowsableAttribute] Offset: 0xAACFF0
    // private System.Int32 <ReliableCommandBytes>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    int ReliableCommandBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAAD02C
    // [DebuggerBrowsableAttribute] Offset: 0xAAD02C
    // private System.Int32 <UnreliableCommandBytes>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int UnreliableCommandBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAAD068
    // [DebuggerBrowsableAttribute] Offset: 0xAAD068
    // private System.Int32 <FragmentCommandBytes>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    int FragmentCommandBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAAD0A4
    // [DebuggerBrowsableAttribute] Offset: 0xAAD0A4
    // private System.Int32 <ControlCommandBytes>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int ControlCommandBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAAD0E0
    // [DebuggerBrowsableAttribute] Offset: 0xAAD0E0
    // private System.Int32 <TimestampOfLastAck>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    int TimestampOfLastAck;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAAD11C
    // [DebuggerBrowsableAttribute] Offset: 0xAAD11C
    // private System.Int32 <TimestampOfLastReliableCommand>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    int TimestampOfLastReliableCommand;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private System.Int32 <PackageHeaderSize>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$PackageHeaderSize$k__BackingField();
    // Get instance field reference: private System.Int32 <ReliableCommandCount>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$ReliableCommandCount$k__BackingField();
    // Get instance field reference: private System.Int32 <UnreliableCommandCount>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$UnreliableCommandCount$k__BackingField();
    // Get instance field reference: private System.Int32 <FragmentCommandCount>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$FragmentCommandCount$k__BackingField();
