// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Resources.UltimateResourceFallbackLocation
#include "System/Resources/UltimateResourceFallbackLocation.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Resources
namespace System::Resources {
  // Forward declaring type: ResourceSet
  class ResourceSet;
  // Forward declaring type: IResourceGroveler
  class IResourceGroveler;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: Assembly
  class Assembly;
  // Forward declaring type: RuntimeAssembly
  class RuntimeAssembly;
  // Forward declaring type: AssemblyName
  class AssemblyName;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: StackCrawlMark
  struct StackCrawlMark;
}
// Completed forward declares
// Type namespace: System.Resources
namespace System::Resources {
  // Forward declaring type: ResourceManager
  class ResourceManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Resources::ResourceManager);
DEFINE_IL2CPP_ARG_TYPE(::System::Resources::ResourceManager*, "System.Resources", "ResourceManager");
// Type namespace: System.Resources
namespace System::Resources {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: System.Resources.ResourceManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: A50C80
  class ResourceManager : public ::Il2CppObject {
    public:
    // Nested type: ::System::Resources::ResourceManager::CultureNameResourceSetPair
    class CultureNameResourceSetPair;
    // Nested type: ::System::Resources::ResourceManager::ResourceManagerMediator
    class ResourceManagerMediator;
    public:
    // protected System.String BaseNameField
    // Size: 0x8
    // Offset: 0x10
    ::StringW BaseNameField;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [ObsoleteAttribute] Offset: 0xA57044
    // protected System.Collections.Hashtable ResourceSets
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Hashtable* ResourceSets;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Resources.ResourceSet> _resourceSets
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Resources::ResourceSet*>* resourceSets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Resources::ResourceSet*>*) == 0x8);
    // private System.String moduleDir
    // Size: 0x8
    // Offset: 0x28
    ::StringW moduleDir;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.Reflection.Assembly MainAssembly
    // Size: 0x8
    // Offset: 0x30
    ::System::Reflection::Assembly* MainAssembly;
    // Field size check
    static_assert(sizeof(::System::Reflection::Assembly*) == 0x8);
    // private System.Type _locationInfo
    // Size: 0x8
    // Offset: 0x38
    ::System::Type* locationInfo;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Type _userResourceSet
    // Size: 0x8
    // Offset: 0x40
    ::System::Type* userResourceSet;
    // Field size check
    static_assert(sizeof(::System::Type*) == 0x8);
    // private System.Globalization.CultureInfo _neutralResourcesCulture
    // Size: 0x8
    // Offset: 0x48
    ::System::Globalization::CultureInfo* neutralResourcesCulture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // private System.Resources.ResourceManager/CultureNameResourceSetPair _lastUsedResourceCache
    // Size: 0x8
    // Offset: 0x50
    ::System::Resources::ResourceManager::CultureNameResourceSetPair* lastUsedResourceCache;
    // Field size check
    static_assert(sizeof(::System::Resources::ResourceManager::CultureNameResourceSetPair*) == 0x8);
    // private System.Boolean _ignoreCase
    // Size: 0x1
    // Offset: 0x58
    bool ignoreCase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean UseManifest
    // Size: 0x1
    // Offset: 0x59
    bool UseManifest;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [OptionalFieldAttribute] Offset: 0xA5707C
    // private System.Boolean UseSatelliteAssem
    // Size: 0x1
    // Offset: 0x5A
    bool UseSatelliteAssem;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseSatelliteAssem and: fallbackLoc
    char __padding11[0x1] = {};
    // [OptionalFieldAttribute] Offset: 0xA570B4
    // private System.Resources.UltimateResourceFallbackLocation _fallbackLoc
    // Size: 0x4
    // Offset: 0x5C
    ::System::Resources::UltimateResourceFallbackLocation fallbackLoc;
    // Field size check
    static_assert(sizeof(::System::Resources::UltimateResourceFallbackLocation) == 0x4);
    // [OptionalFieldAttribute] Offset: 0xA570C4
    // private System.Version _satelliteContractVersion
    // Size: 0x8
    // Offset: 0x60
    ::System::Version* satelliteContractVersion;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xA570D4
    // private System.Boolean _lookedForSatelliteContractVersion
    // Size: 0x1
    // Offset: 0x68
    bool lookedForSatelliteContractVersion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lookedForSatelliteContractVersion and: callingAssembly
    char __padding14[0x7] = {};
    // [OptionalFieldAttribute] Offset: 0xA570E4
    // private System.Reflection.Assembly _callingAssembly
    // Size: 0x8
    // Offset: 0x70
    ::System::Reflection::Assembly* callingAssembly;
    // Field size check
    static_assert(sizeof(::System::Reflection::Assembly*) == 0x8);
    // [OptionalFieldAttribute] Offset: 0xA5711C
    // private System.Reflection.RuntimeAssembly m_callingAssembly
    // Size: 0x8
    // Offset: 0x78
    ::System::Reflection::RuntimeAssembly* m_callingAssembly;
    // Field size check
    static_assert(sizeof(::System::Reflection::RuntimeAssembly*) == 0x8);
    // private System.Resources.IResourceGroveler resourceGroveler
    // Size: 0x8
    // Offset: 0x80
    ::System::Resources::IResourceGroveler* resourceGroveler;
    // Field size check
    static_assert(sizeof(::System::Resources::IResourceGroveler*) == 0x8);
    public:
    // Get static field: static public readonly System.Int32 MagicNumber
    static int _get_MagicNumber();
    // Set static field: static public readonly System.Int32 MagicNumber
    static void _set_MagicNumber(int value);
    // Get static field: static public readonly System.Int32 HeaderVersionNumber
    static int _get_HeaderVersionNumber();
    // Set static field: static public readonly System.Int32 HeaderVersionNumber
    static void _set_HeaderVersionNumber(int value);
    // Get static field: static private readonly System.Type _minResourceSet
    static ::System::Type* _get__minResourceSet();
    // Set static field: static private readonly System.Type _minResourceSet
    static void _set__minResourceSet(::System::Type* value);
