// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.ContactPoint
#include "UnityEngine/ContactPoint.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collision
  class Collision;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Collision);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Collision*, "UnityEngine", "Collision");
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0x50
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Collision
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequiredByNativeCodeAttribute] Offset: A78CA0
  class Collision : public ::Il2CppObject {
    public:
    public:
    // UnityEngine.Vector3 m_Impulse
    // Size: 0xC
    // Offset: 0x10
    ::UnityEngine::Vector3 m_Impulse;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 m_RelativeVelocity
    // Size: 0xC
    // Offset: 0x1C
    ::UnityEngine::Vector3 m_RelativeVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Rigidbody m_Rigidbody
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rigidbody* m_Rigidbody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // UnityEngine.Collider m_Collider
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Collider* m_Collider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // System.Int32 m_ContactCount
    // Size: 0x4
    // Offset: 0x38
    int m_ContactCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_ContactCount and: m_ReusedContacts
    char __padding4[0x4] = {};
    // UnityEngine.ContactPoint[] m_ReusedContacts
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::ContactPoint> m_ReusedContacts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ContactPoint>) == 0x8);
    // UnityEngine.ContactPoint[] m_LegacyContacts
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::ContactPoint> m_LegacyContacts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ContactPoint>) == 0x8);
    public:
    // Get instance field reference: UnityEngine.Vector3 m_Impulse
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_Impulse();
    // Get instance field reference: UnityEngine.Vector3 m_RelativeVelocity
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_RelativeVelocity();
    // Get instance field reference: UnityEngine.Rigidbody m_Rigidbody
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_m_Rigidbody();
    // Get instance field reference: UnityEngine.Collider m_Collider
    [[deprecated("Use field access instead!")]] ::UnityEngine::Collider*& dyn_m_Collider();
    // Get instance field reference: System.Int32 m_ContactCount
    [[deprecated("Use field access instead!")]] int& dyn_m_ContactCount();
    // Get instance field reference: UnityEngine.ContactPoint[] m_ReusedContacts
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::ContactPoint>& dyn_m_ReusedContacts();
    // Get instance field reference: UnityEngine.ContactPoint[] m_LegacyContacts
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::ContactPoint>& dyn_m_LegacyContacts();
    // private UnityEngine.ContactPoint[] GetContacts_Internal()
    // Offset: 0x1B35BB4
    ::ArrayW<::UnityEngine::ContactPoint> GetContacts_Internal();
    // public UnityEngine.Vector3 get_relativeVelocity()
    // Offset: 0x1B35BCC
    ::UnityEngine::Vector3 get_relativeVelocity();
    // public UnityEngine.Collider get_collider()
    // Offset: 0x1B35BD8
    ::UnityEngine::Collider* get_collider();
    // public UnityEngine.GameObject get_gameObject()
    // Offset: 0x1B35BE0
    ::UnityEngine::GameObject* get_gameObject();
    // public UnityEngine.ContactPoint GetContact(System.Int32 index)
    // Offset: 0x1B35C70
    ::UnityEngine::ContactPoint GetContact(int index);
  }; // UnityEngine.Collision
  #pragma pack(pop)
  static check_size<sizeof(Collision), 72 + sizeof(::ArrayW<::UnityEngine::ContactPoint>)> __UnityEngine_CollisionSizeCheck;
  static_assert(sizeof(Collision) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Collision::GetContacts_Internal
// Il2CppName: GetContacts_Internal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<::UnityEngine::ContactPoint> (UnityEngine::Collision::*)()>(&UnityEngine::Collision::GetContacts_Internal)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Collision*), "GetContacts_Internal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Collision::get_relativeVelocity
// Il2CppName: get_relativeVelocity
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (UnityEngine::Collision::*)()>(&UnityEngine::Collision::get_relativeVelocity)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Collision*), "get_relativeVelocity", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Collision::get_collider
// Il2CppName: get_collider
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Collider* (UnityEngine::Collision::*)()>(&UnityEngine::Collision::get_collider)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Collision*), "get_collider", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Collision::get_gameObject
// Il2CppName: get_gameObject
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::GameObject* (UnityEngine::Collision::*)()>(&UnityEngine::Collision::get_gameObject)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Collision*), "get_gameObject", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Collision::GetContact
// Il2CppName: GetContact
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::ContactPoint (UnityEngine::Collision::*)(int)>(&UnityEngine::Collision::GetContact)> {
  static const MethodInfo* get() {
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Collision*), "GetContact", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{index});
  }
};
