// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Cinemachine.LensSettings
#include "Cinemachine/LensSettings.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Skipping declaration: BlendHintValue because it is already included!
  // Skipping declaration: CustomBlendable because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CameraState
  struct CameraState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CameraState, "Cinemachine", "CameraState");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0xE4
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Cinemachine.CameraState
  // [TokenAttribute] Offset: FFFFFFFF
  struct CameraState/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Cinemachine::CameraState::BlendHintValue
    struct BlendHintValue;
    // Nested type: ::Cinemachine::CameraState::CustomBlendable
    struct CustomBlendable;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Cinemachine.CameraState/BlendHintValue
    // [TokenAttribute] Offset: FFFFFFFF
    struct BlendHintValue/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BlendHintValue
      constexpr BlendHintValue(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Cinemachine.CameraState/BlendHintValue Nothing
      static constexpr const int Nothing = 0;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue Nothing
      static ::Cinemachine::CameraState::BlendHintValue _get_Nothing();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue Nothing
      static void _set_Nothing(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue NoPosition
      static constexpr const int NoPosition = 1;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue NoPosition
      static ::Cinemachine::CameraState::BlendHintValue _get_NoPosition();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue NoPosition
      static void _set_NoPosition(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue NoOrientation
      static constexpr const int NoOrientation = 2;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue NoOrientation
      static ::Cinemachine::CameraState::BlendHintValue _get_NoOrientation();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue NoOrientation
      static void _set_NoOrientation(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue NoTransform
      static constexpr const int NoTransform = 3;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue NoTransform
      static ::Cinemachine::CameraState::BlendHintValue _get_NoTransform();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue NoTransform
      static void _set_NoTransform(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue SphericalPositionBlend
      static constexpr const int SphericalPositionBlend = 4;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue SphericalPositionBlend
      static ::Cinemachine::CameraState::BlendHintValue _get_SphericalPositionBlend();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue SphericalPositionBlend
      static void _set_SphericalPositionBlend(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue CylindricalPositionBlend
      static constexpr const int CylindricalPositionBlend = 8;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue CylindricalPositionBlend
      static ::Cinemachine::CameraState::BlendHintValue _get_CylindricalPositionBlend();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue CylindricalPositionBlend
      static void _set_CylindricalPositionBlend(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue RadialAimBlend
      static constexpr const int RadialAimBlend = 16;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue RadialAimBlend
      static ::Cinemachine::CameraState::BlendHintValue _get_RadialAimBlend();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue RadialAimBlend
      static void _set_RadialAimBlend(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue IgnoreLookAtTarget
      static constexpr const int IgnoreLookAtTarget = 32;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue IgnoreLookAtTarget
      static ::Cinemachine::CameraState::BlendHintValue _get_IgnoreLookAtTarget();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue IgnoreLookAtTarget
      static void _set_IgnoreLookAtTarget(::Cinemachine::CameraState::BlendHintValue value);
      // static field const value: static public Cinemachine.CameraState/BlendHintValue NoLens
      static constexpr const int NoLens = 64;
      // Get static field: static public Cinemachine.CameraState/BlendHintValue NoLens
      static ::Cinemachine::CameraState::BlendHintValue _get_NoLens();
      // Set static field: static public Cinemachine.CameraState/BlendHintValue NoLens
      static void _set_NoLens(::Cinemachine::CameraState::BlendHintValue value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Cinemachine.CameraState/BlendHintValue
    #pragma pack(pop)
    static check_size<sizeof(CameraState::BlendHintValue), 0 + sizeof(int)> __Cinemachine_CameraState_BlendHintValueSizeCheck;
    static_assert(sizeof(CameraState::BlendHintValue) == 0x4);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CameraState/CustomBlendable
    // [TokenAttribute] Offset: FFFFFFFF
    struct CustomBlendable/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Object m_Custom
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Object* m_Custom;
      // Field size check
      static_assert(sizeof(::UnityEngine::Object*) == 0x8);
      // public System.Single m_Weight
      // Size: 0x4
      // Offset: 0x8
      float m_Weight;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: CustomBlendable
      constexpr CustomBlendable(::UnityEngine::Object* m_Custom_ = {}, float m_Weight_ = {}) noexcept : m_Custom{m_Custom_}, m_Weight{m_Weight_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Object m_Custom
      [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn_m_Custom();
      // Get instance field reference: public System.Single m_Weight
      [[deprecated("Use field access instead!")]] float& dyn_m_Weight();
      // public System.Void .ctor(UnityEngine.Object custom, System.Single weight)
      // Offset: 0x9B134C
      // ABORTED: conflicts with another method.  CustomBlendable(::UnityEngine::Object* custom, float weight);
    }; // Cinemachine.CameraState/CustomBlendable
    #pragma pack(pop)
    static check_size<sizeof(CameraState::CustomBlendable), 8 + sizeof(float)> __Cinemachine_CameraState_CustomBlendableSizeCheck;
    static_assert(sizeof(CameraState::CustomBlendable) == 0xC);
    public:
    // [CompilerGeneratedAttribute] Offset: 0xAEAEA0
    // private Cinemachine.LensSettings <Lens>k__BackingField
    // Size: 0x2E
    // Offset: 0x0
    ::Cinemachine::LensSettings Lens;
    // Field size check
    static_assert(sizeof(::Cinemachine::LensSettings) == 0x2E);
    // Padding between fields: Lens and: ReferenceUp
    char __padding0[0x2] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAEAEB0
    // private UnityEngine.Vector3 <ReferenceUp>k__BackingField
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 ReferenceUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAEAEC0
    // private UnityEngine.Vector3 <ReferenceLookAt>k__BackingField
    // Size: 0xC
    // Offset: 0x3C
    ::UnityEngine::Vector3 ReferenceLookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAEAED0
    // private UnityEngine.Vector3 <RawPosition>k__BackingField
    // Size: 0xC
    // Offset: 0x48
    ::UnityEngine::Vector3 RawPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAEAEE0
    // private UnityEngine.Quaternion <RawOrientation>k__BackingField
    // Size: 0x10
    // Offset: 0x54
    ::UnityEngine::Quaternion RawOrientation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // [CompilerGeneratedAttribute] Offset: 0xAEAEF0
    // private UnityEngine.Vector3 <PositionDampingBypass>k__BackingField
    // Size: 0xC
    // Offset: 0x64
    ::UnityEngine::Vector3 PositionDampingBypass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAEAF00
    // private System.Single <ShotQuality>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    float ShotQuality;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAEAF10
    // private UnityEngine.Vector3 <PositionCorrection>k__BackingField
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 PositionCorrection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAEAF20
    // private UnityEngine.Quaternion <OrientationCorrection>k__BackingField
    // Size: 0x10
    // Offset: 0x80
    ::UnityEngine::Quaternion OrientationCorrection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // [CompilerGeneratedAttribute] Offset: 0xAEAF30
    // private Cinemachine.CameraState/BlendHintValue <BlendHint>k__BackingField
    // Size: 0x4
    // Offset: 0x90
    ::Cinemachine::CameraState::BlendHintValue BlendHint;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState::BlendHintValue) == 0x4);
    // Padding between fields: BlendHint and: mCustom0
    char __padding9[0x4] = {};
    // private Cinemachine.CameraState/CustomBlendable mCustom0
    // Size: 0xC
    // Offset: 0x98
    ::Cinemachine::CameraState::CustomBlendable mCustom0;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState::CustomBlendable) == 0xC);
    // Padding between fields: mCustom0 and: mCustom1
    char __padding10[0x4] = {};
    // private Cinemachine.CameraState/CustomBlendable mCustom1
    // Size: 0xC
    // Offset: 0xA8
    ::Cinemachine::CameraState::CustomBlendable mCustom1;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState::CustomBlendable) == 0xC);
    // Padding between fields: mCustom1 and: mCustom2
    char __padding11[0x4] = {};
    // private Cinemachine.CameraState/CustomBlendable mCustom2
    // Size: 0xC
    // Offset: 0xB8
    ::Cinemachine::CameraState::CustomBlendable mCustom2;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState::CustomBlendable) == 0xC);
    // Padding between fields: mCustom2 and: mCustom3
    char __padding12[0x4] = {};
    // private Cinemachine.CameraState/CustomBlendable mCustom3
    // Size: 0xC
    // Offset: 0xC8
    ::Cinemachine::CameraState::CustomBlendable mCustom3;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState::CustomBlendable) == 0xC);
    // Padding between fields: mCustom3 and: m_CustomOverflow
    char __padding13[0x4] = {};
    // private System.Collections.Generic.List`1<Cinemachine.CameraState/CustomBlendable> m_CustomOverflow
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::List_1<::Cinemachine::CameraState::CustomBlendable>* m_CustomOverflow;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::CameraState::CustomBlendable>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAEAF40
    // private System.Int32 <NumCustomBlendables>k__BackingField
    // Size: 0x4
    // Offset: 0xE0
    int NumCustomBlendables;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: CameraState
