// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: Authorization
  class Authorization;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::Authorization);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::Authorization*, "System.Net", "Authorization");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Authorization
  // [TokenAttribute] Offset: FFFFFFFF
  class Authorization : public ::Il2CppObject {
    public:
    public:
    // private System.String m_Message
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_Message;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_Complete
    // Size: 0x1
    // Offset: 0x18
    bool m_Complete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Complete and: m_ProtectionRealm
    char __padding1[0x7] = {};
    // private System.String[] m_ProtectionRealm
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::StringW> m_ProtectionRealm;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String m_ConnectionGroupId
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_ConnectionGroupId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_MutualAuth
    // Size: 0x1
    // Offset: 0x30
    bool m_MutualAuth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MutualAuth and: ModuleAuthenticationType
    char __padding4[0x7] = {};
    // System.String ModuleAuthenticationType
    // Size: 0x8
    // Offset: 0x38
    ::StringW ModuleAuthenticationType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: private System.String m_Message
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Message();
    // Get instance field reference: private System.Boolean m_Complete
    [[deprecated("Use field access instead!")]] bool& dyn_m_Complete();
    // Get instance field reference: private System.String[] m_ProtectionRealm
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_m_ProtectionRealm();
    // Get instance field reference: private System.String m_ConnectionGroupId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_ConnectionGroupId();
    // Get instance field reference: private System.Boolean m_MutualAuth
    [[deprecated("Use field access instead!")]] bool& dyn_m_MutualAuth();
    // Get instance field reference: System.String ModuleAuthenticationType
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ModuleAuthenticationType();
    // public System.Void .ctor(System.String token)
    // Offset: 0x126664C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Authorization* New_ctor(::StringW token) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Net::Authorization::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Authorization*, creationType>(token)));
    }
    // public System.Void .ctor(System.String token, System.Boolean finished)
    // Offset: 0x12666DC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Authorization* New_ctor(::StringW token, bool finished) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Net::Authorization::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Authorization*, creationType>(token, finished)));
    }
    // public System.Void .ctor(System.String token, System.Boolean finished, System.String connectionGroupId)
    // Offset: 0x1266770
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Authorization* New_ctor(::StringW token, bool finished, ::StringW connectionGroupId) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Net::Authorization::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Authorization*, creationType>(token, finished, connectionGroupId)));
    }
    // System.Void .ctor(System.String token, System.Boolean finished, System.String connectionGroupId, System.Boolean mutualAuth)
    // Offset: 0x126677C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Authorization* New_ctor(::StringW token, bool finished, ::StringW connectionGroupId, bool mutualAuth) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Net::Authorization::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Authorization*, creationType>(token, finished, connectionGroupId, mutualAuth)));
    }
    // public System.String get_Message()
    // Offset: 0x1266838
    ::StringW get_Message();
    // public System.String get_ConnectionGroupId()
    // Offset: 0x1266840
    ::StringW get_ConnectionGroupId();
    // public System.Boolean get_Complete()
    // Offset: 0x1266848
    bool get_Complete();
    // System.Void SetComplete(System.Boolean complete)
    // Offset: 0x1266850
    void SetComplete(bool complete);
    // public System.String[] get_ProtectionRealm()
    // Offset: 0x126685C
    ::ArrayW<::StringW> get_ProtectionRealm();
    // public System.Void set_ProtectionRealm(System.String[] value)
    // Offset: 0x1266864
    void set_ProtectionRealm(::ArrayW<::StringW> value);
    // public System.Boolean get_MutuallyAuthenticated()
    // Offset: 0x12668E0
    bool get_MutuallyAuthenticated();
    // public System.Void set_MutuallyAuthenticated(System.Boolean value)
    // Offset: 0x1266900
    void set_MutuallyAuthenticated(bool value);
  }; // System.Net.Authorization
  #pragma pack(pop)
  static check_size<sizeof(Authorization), 56 + sizeof(::StringW)> __System_Net_AuthorizationSizeCheck;
  static_assert(sizeof(Authorization) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Net::Authorization::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Net::Authorization::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Net::Authorization::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Net::Authorization::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Net::Authorization::get_Message
// Il2CppName: get_Message
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (System::Net::Authorization::*)()>(&System::Net::Authorization::get_Message)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "get_Message", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::get_ConnectionGroupId
// Il2CppName: get_ConnectionGroupId
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (System::Net::Authorization::*)()>(&System::Net::Authorization::get_ConnectionGroupId)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "get_ConnectionGroupId", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::get_Complete
// Il2CppName: get_Complete
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Net::Authorization::*)()>(&System::Net::Authorization::get_Complete)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "get_Complete", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::SetComplete
// Il2CppName: SetComplete
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Net::Authorization::*)(bool)>(&System::Net::Authorization::SetComplete)> {
  static const MethodInfo* get() {
    static auto* complete = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "SetComplete", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{complete});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::get_ProtectionRealm
// Il2CppName: get_ProtectionRealm
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<::StringW> (System::Net::Authorization::*)()>(&System::Net::Authorization::get_ProtectionRealm)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "get_ProtectionRealm", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::set_ProtectionRealm
// Il2CppName: set_ProtectionRealm
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Net::Authorization::*)(::ArrayW<::StringW>)>(&System::Net::Authorization::set_ProtectionRealm)> {
  static const MethodInfo* get() {
    static auto* value = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "String"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "set_ProtectionRealm", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::get_MutuallyAuthenticated
// Il2CppName: get_MutuallyAuthenticated
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Net::Authorization::*)()>(&System::Net::Authorization::get_MutuallyAuthenticated)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "get_MutuallyAuthenticated", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::Authorization::set_MutuallyAuthenticated
// Il2CppName: set_MutuallyAuthenticated
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Net::Authorization::*)(bool)>(&System::Net::Authorization::set_MutuallyAuthenticated)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::Authorization*), "set_MutuallyAuthenticated", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
