// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebRequest
#include "System/Net/WebRequest.hpp"
// Including type: System.Net.DecompressionMethods
#include "System/Net/DecompressionMethods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Skipping declaration: NtlmAuthState because it is already included!
  // Forward declaring type: HttpContinueDelegate
  class HttpContinueDelegate;
  // Forward declaring type: CookieContainer
  class CookieContainer;
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: IWebProxy
  class IWebProxy;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: WebConnectionStream
  class WebConnectionStream;
  // Forward declaring type: HttpWebResponse
  class HttpWebResponse;
  // Forward declaring type: WebAsyncResult
  class WebAsyncResult;
  // Forward declaring type: WebConnection
  class WebConnection;
  // Forward declaring type: ServerCertValidationCallback
  class ServerCertValidationCallback;
  // Forward declaring type: TransportContext
  class TransportContext;
  // Forward declaring type: SimpleAsyncResult
  class SimpleAsyncResult;
  // Forward declaring type: HttpStatusCode
  struct HttpStatusCode;
  // Forward declaring type: WebResponse
  class WebResponse;
  // Forward declaring type: WebExceptionStatus
  struct WebExceptionStatus;
  // Forward declaring type: SimpleAsyncCallback
  class SimpleAsyncCallback;
  // Forward declaring type: WebConnectionData
  class WebConnectionData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: DateTime
  struct DateTime;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: Mono::Security::Interface
namespace Mono::Security::Interface {
  // Forward declaring type: MonoTlsProvider
  class MonoTlsProvider;
  // Forward declaring type: MonoTlsSettings
  class MonoTlsSettings;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Net::Security
namespace System::Net::Security {
  // Forward declaring type: RemoteCertificateValidationCallback
  class RemoteCertificateValidationCallback;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::HttpWebRequest);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::HttpWebRequest*, "System.Net", "HttpWebRequest");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x1C8
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.HttpWebRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class HttpWebRequest : public ::System::Net::WebRequest {
    public:
    // Nested type: ::System::Net::HttpWebRequest::NtlmAuthState
    struct NtlmAuthState;
    // Nested type: ::System::Net::HttpWebRequest::AuthorizationState
    struct AuthorizationState;
    // Nested type: ::System::Net::HttpWebRequest::$$c__DisplayClass238_0
    class $$c__DisplayClass238_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.HttpWebRequest/NtlmAuthState
    // [TokenAttribute] Offset: FFFFFFFF
    struct NtlmAuthState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NtlmAuthState
      constexpr NtlmAuthState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.HttpWebRequest/NtlmAuthState None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.HttpWebRequest/NtlmAuthState None
      static ::System::Net::HttpWebRequest::NtlmAuthState _get_None();
      // Set static field: static public System.Net.HttpWebRequest/NtlmAuthState None
      static void _set_None(::System::Net::HttpWebRequest::NtlmAuthState value);
      // static field const value: static public System.Net.HttpWebRequest/NtlmAuthState Challenge
      static constexpr const int Challenge = 1;
      // Get static field: static public System.Net.HttpWebRequest/NtlmAuthState Challenge
      static ::System::Net::HttpWebRequest::NtlmAuthState _get_Challenge();
      // Set static field: static public System.Net.HttpWebRequest/NtlmAuthState Challenge
      static void _set_Challenge(::System::Net::HttpWebRequest::NtlmAuthState value);
      // static field const value: static public System.Net.HttpWebRequest/NtlmAuthState Response
      static constexpr const int Response = 2;
      // Get static field: static public System.Net.HttpWebRequest/NtlmAuthState Response
      static ::System::Net::HttpWebRequest::NtlmAuthState _get_Response();
      // Set static field: static public System.Net.HttpWebRequest/NtlmAuthState Response
      static void _set_Response(::System::Net::HttpWebRequest::NtlmAuthState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Net.HttpWebRequest/NtlmAuthState
    #pragma pack(pop)
    static check_size<sizeof(HttpWebRequest::NtlmAuthState), 0 + sizeof(int)> __System_Net_HttpWebRequest_NtlmAuthStateSizeCheck;
    static_assert(sizeof(HttpWebRequest::NtlmAuthState) == 0x4);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Net.HttpWebRequest/AuthorizationState
    // [TokenAttribute] Offset: FFFFFFFF
    struct AuthorizationState/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly System.Net.HttpWebRequest request
      // Size: 0x8
      // Offset: 0x0
      ::System::Net::HttpWebRequest* request;
      // Field size check
      static_assert(sizeof(::System::Net::HttpWebRequest*) == 0x8);
      // private readonly System.Boolean isProxy
      // Size: 0x1
      // Offset: 0x8
      bool isProxy;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // private System.Boolean isCompleted
      // Size: 0x1
      // Offset: 0x9
      bool isCompleted;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isCompleted and: ntlm_auth_state
      char __padding2[0x2] = {};
      // private System.Net.HttpWebRequest/NtlmAuthState ntlm_auth_state
      // Size: 0x4
      // Offset: 0xC
      ::System::Net::HttpWebRequest::NtlmAuthState ntlm_auth_state;
      // Field size check
      static_assert(sizeof(::System::Net::HttpWebRequest::NtlmAuthState) == 0x4);
      public:
      // Creating value type constructor for type: AuthorizationState
      constexpr AuthorizationState(::System::Net::HttpWebRequest* request_ = {}, bool isProxy_ = {}, bool isCompleted_ = {}, ::System::Net::HttpWebRequest::NtlmAuthState ntlm_auth_state_ = {}) noexcept : request{request_}, isProxy{isProxy_}, isCompleted{isCompleted_}, ntlm_auth_state{ntlm_auth_state_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private readonly System.Net.HttpWebRequest request
      [[deprecated("Use field access instead!")]] ::System::Net::HttpWebRequest*& dyn_request();
      // Get instance field reference: private readonly System.Boolean isProxy
      [[deprecated("Use field access instead!")]] bool& dyn_isProxy();
      // Get instance field reference: private System.Boolean isCompleted
      [[deprecated("Use field access instead!")]] bool& dyn_isCompleted();
      // Get instance field reference: private System.Net.HttpWebRequest/NtlmAuthState ntlm_auth_state
      [[deprecated("Use field access instead!")]] ::System::Net::HttpWebRequest::NtlmAuthState& dyn_ntlm_auth_state();
      // public System.Boolean get_IsCompleted()
      // Offset: 0x9A14D0
      bool get_IsCompleted();
      // public System.Net.HttpWebRequest/NtlmAuthState get_NtlmAuthState()
      // Offset: 0x9A14D8
      ::System::Net::HttpWebRequest::NtlmAuthState get_NtlmAuthState();
      // public System.Boolean get_IsNtlmAuthenticated()
      // Offset: 0x9A14E0
      bool get_IsNtlmAuthenticated();
      // public System.Void .ctor(System.Net.HttpWebRequest request, System.Boolean isProxy)
      // Offset: 0x9A1500
      AuthorizationState(::System::Net::HttpWebRequest* request, bool isProxy);
      // public System.Boolean CheckAuthorization(System.Net.WebResponse response, System.Net.HttpStatusCode code)
      // Offset: 0x9A1518
      bool CheckAuthorization(::System::Net::WebResponse* response, ::System::Net::HttpStatusCode code);
      // public System.Void Reset()
      // Offset: 0x9A1520
      void Reset();
      // public override System.String ToString()
      // Offset: 0x9A1528
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::StringW ToString();
    }; // System.Net.HttpWebRequest/AuthorizationState
    #pragma pack(pop)
    static check_size<sizeof(HttpWebRequest::AuthorizationState), 12 + sizeof(::System::Net::HttpWebRequest::NtlmAuthState)> __System_Net_HttpWebRequest_AuthorizationStateSizeCheck;
    static_assert(sizeof(HttpWebRequest::AuthorizationState) == 0x10);
    public:
    // private System.Uri requestUri
    // Size: 0x8
    // Offset: 0x38
    ::System::Uri* requestUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Uri actualUri
    // Size: 0x8
    // Offset: 0x40
    ::System::Uri* actualUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Boolean hostChanged
    // Size: 0x1
    // Offset: 0x48
    bool hostChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean allowAutoRedirect
    // Size: 0x1
    // Offset: 0x49
    bool allowAutoRedirect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean allowBuffering
    // Size: 0x1
    // Offset: 0x4A
    bool allowBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowBuffering and: certificates
    char __padding4[0x5] = {};
    // private System.Security.Cryptography.X509Certificates.X509CertificateCollection certificates
    // Size: 0x8
    // Offset: 0x50
    ::System::Security::Cryptography::X509Certificates::X509CertificateCollection* certificates;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X509CertificateCollection*) == 0x8);
    // private System.String connectionGroup
    // Size: 0x8
    // Offset: 0x58
    ::StringW connectionGroup;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean haveContentLength
    // Size: 0x1
    // Offset: 0x60
    bool haveContentLength;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: haveContentLength and: contentLength
    char __padding7[0x7] = {};
    // private System.Int64 contentLength
    // Size: 0x8
    // Offset: 0x68
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Net.HttpContinueDelegate continueDelegate
    // Size: 0x8
    // Offset: 0x70
    ::System::Net::HttpContinueDelegate* continueDelegate;
    // Field size check
    static_assert(sizeof(::System::Net::HttpContinueDelegate*) == 0x8);
    // private System.Net.CookieContainer cookieContainer
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::CookieContainer* cookieContainer;
    // Field size check
    static_assert(sizeof(::System::Net::CookieContainer*) == 0x8);
    // private System.Net.ICredentials credentials
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::ICredentials* credentials;
    // Field size check
    static_assert(sizeof(::System::Net::ICredentials*) == 0x8);
    // private System.Boolean haveResponse
    // Size: 0x1
    // Offset: 0x88
    bool haveResponse;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean haveRequest
    // Size: 0x1
    // Offset: 0x89
    bool haveRequest;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean requestSent
    // Size: 0x1
    // Offset: 0x8A
    bool requestSent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: requestSent and: webHeaders
    char __padding14[0x5] = {};
    // private System.Net.WebHeaderCollection webHeaders
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::WebHeaderCollection* webHeaders;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Boolean keepAlive
    // Size: 0x1
    // Offset: 0x98
    bool keepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: keepAlive and: maxAutoRedirect
    char __padding16[0x3] = {};
    // private System.Int32 maxAutoRedirect
    // Size: 0x4
    // Offset: 0x9C
    int maxAutoRedirect;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String mediaType
    // Size: 0x8
    // Offset: 0xA0
    ::StringW mediaType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String method
    // Size: 0x8
    // Offset: 0xA8
    ::StringW method;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String initialMethod
    // Size: 0x8
    // Offset: 0xB0
    ::StringW initialMethod;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean pipelined
    // Size: 0x1
    // Offset: 0xB8
    bool pipelined;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean preAuthenticate
    // Size: 0x1
    // Offset: 0xB9
    bool preAuthenticate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean usedPreAuth
    // Size: 0x1
    // Offset: 0xBA
    bool usedPreAuth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: usedPreAuth and: version
    char __padding23[0x5] = {};
    // private System.Version version
    // Size: 0x8
    // Offset: 0xC0
    ::System::Version* version;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Boolean force_version
    // Size: 0x1
    // Offset: 0xC8
    bool force_version;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: force_version and: actualVersion
    char __padding25[0x7] = {};
    // private System.Version actualVersion
    // Size: 0x8
    // Offset: 0xD0
    ::System::Version* actualVersion;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Net.IWebProxy proxy
    // Size: 0x8
    // Offset: 0xD8
    ::System::Net::IWebProxy* proxy;
    // Field size check
    static_assert(sizeof(::System::Net::IWebProxy*) == 0x8);
    // private System.Boolean sendChunked
    // Size: 0x1
    // Offset: 0xE0
    bool sendChunked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sendChunked and: servicePoint
    char __padding28[0x7] = {};
    // private System.Net.ServicePoint servicePoint
    // Size: 0x8
    // Offset: 0xE8
    ::System::Net::ServicePoint* servicePoint;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePoint*) == 0x8);
    // private System.Int32 timeout
    // Size: 0x4
    // Offset: 0xF0
    int timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: timeout and: writeStream
    char __padding30[0x4] = {};
    // private System.Net.WebConnectionStream writeStream
    // Size: 0x8
    // Offset: 0xF8
    ::System::Net::WebConnectionStream* writeStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebConnectionStream*) == 0x8);
    // private System.Net.HttpWebResponse webResponse
    // Size: 0x8
    // Offset: 0x100
    ::System::Net::HttpWebResponse* webResponse;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebResponse*) == 0x8);
    // private System.Net.WebAsyncResult asyncWrite
    // Size: 0x8
    // Offset: 0x108
    ::System::Net::WebAsyncResult* asyncWrite;
    // Field size check
    static_assert(sizeof(::System::Net::WebAsyncResult*) == 0x8);
    // private System.Net.WebAsyncResult asyncRead
    // Size: 0x8
    // Offset: 0x110
    ::System::Net::WebAsyncResult* asyncRead;
    // Field size check
    static_assert(sizeof(::System::Net::WebAsyncResult*) == 0x8);
    // private System.EventHandler abortHandler
    // Size: 0x8
    // Offset: 0x118
    ::System::EventHandler* abortHandler;
    // Field size check
    static_assert(sizeof(::System::EventHandler*) == 0x8);
    // private System.Int32 aborted
    // Size: 0x4
    // Offset: 0x120
    int aborted;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean gotRequestStream
    // Size: 0x1
    // Offset: 0x124
    bool gotRequestStream;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: gotRequestStream and: redirects
    char __padding37[0x3] = {};
    // private System.Int32 redirects
    // Size: 0x4
    // Offset: 0x128
    int redirects;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean expectContinue
    // Size: 0x1
    // Offset: 0x12C
    bool expectContinue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: expectContinue and: bodyBuffer
    char __padding39[0x3] = {};
    // private System.Byte[] bodyBuffer
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<uint8_t> bodyBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 bodyBufferLength
    // Size: 0x4
    // Offset: 0x138
    int bodyBufferLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean getResponseCalled
    // Size: 0x1
    // Offset: 0x13C
    bool getResponseCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: getResponseCalled and: saved_exc
    char __padding42[0x3] = {};
    // private System.Exception saved_exc
    // Size: 0x8
    // Offset: 0x140
    ::System::Exception* saved_exc;
    // Field size check
    static_assert(sizeof(::System::Exception*) == 0x8);
    // private System.Object locker
    // Size: 0x8
    // Offset: 0x148
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean finished_reading
    // Size: 0x1
    // Offset: 0x150
    bool finished_reading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: finished_reading and: WebConnection
    char __padding45[0x7] = {};
    // System.Net.WebConnection WebConnection
    // Size: 0x8
    // Offset: 0x158
    ::System::Net::WebConnection* WebConnection;
    // Field size check
    static_assert(sizeof(::System::Net::WebConnection*) == 0x8);
    // private System.Net.DecompressionMethods auto_decomp
    // Size: 0x4
    // Offset: 0x160
    ::System::Net::DecompressionMethods auto_decomp;
    // Field size check
    static_assert(sizeof(::System::Net::DecompressionMethods) == 0x4);
    // private System.Int32 maxResponseHeadersLength
    // Size: 0x4
    // Offset: 0x164
    int maxResponseHeadersLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 readWriteTimeout
    // Size: 0x4
    // Offset: 0x168
    int readWriteTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: readWriteTimeout and: tlsProvider
    char __padding49[0x4] = {};
    // private Mono.Security.Interface.MonoTlsProvider tlsProvider
    // Size: 0x8
    // Offset: 0x170
    ::Mono::Security::Interface::MonoTlsProvider* tlsProvider;
    // Field size check
    static_assert(sizeof(::Mono::Security::Interface::MonoTlsProvider*) == 0x8);
    // private Mono.Security.Interface.MonoTlsSettings tlsSettings
    // Size: 0x8
    // Offset: 0x178
    ::Mono::Security::Interface::MonoTlsSettings* tlsSettings;
    // Field size check
    static_assert(sizeof(::Mono::Security::Interface::MonoTlsSettings*) == 0x8);
    // private System.Net.ServerCertValidationCallback certValidationCallback
    // Size: 0x8
    // Offset: 0x180
    ::System::Net::ServerCertValidationCallback* certValidationCallback;
    // Field size check
    static_assert(sizeof(::System::Net::ServerCertValidationCallback*) == 0x8);
    // private System.Net.HttpWebRequest/AuthorizationState auth_state
    // Size: 0x10
    // Offset: 0x188
    ::System::Net::HttpWebRequest::AuthorizationState auth_state;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebRequest::AuthorizationState) == 0x10);
    // private System.Net.HttpWebRequest/AuthorizationState proxy_auth_state
    // Size: 0x10
    // Offset: 0x198
    ::System::Net::HttpWebRequest::AuthorizationState proxy_auth_state;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebRequest::AuthorizationState) == 0x10);
    // private System.String host
    // Size: 0x8
    // Offset: 0x1A8
    ::StringW host;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Action`1<System.IO.Stream> ResendContentFactory
    // Size: 0x8
    // Offset: 0x1B0
    ::System::Action_1<::System::IO::Stream*>* ResendContentFactory;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::IO::Stream*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA609A4
    // private System.Boolean <ThrowOnError>k__BackingField
    // Size: 0x1
    // Offset: 0x1B8
    bool ThrowOnError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean unsafe_auth_blah
    // Size: 0x1
    // Offset: 0x1B9
    bool unsafe_auth_blah;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xA609B4
    // private System.Boolean <ReuseConnection>k__BackingField
    // Size: 0x1
    // Offset: 0x1BA
    bool ReuseConnection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ReuseConnection and: StoredConnection
    char __padding59[0x5] = {};
    // System.Net.WebConnection StoredConnection
    // Size: 0x8
    // Offset: 0x1C0
    ::System::Net::WebConnection* StoredConnection;
    // Field size check
    static_assert(sizeof(::System::Net::WebConnection*) == 0x8);
    public:
    // Get static field: static private System.Int32 defaultMaxResponseHeadersLength
    static int _get_defaultMaxResponseHeadersLength();
    // Set static field: static private System.Int32 defaultMaxResponseHeadersLength
    static void _set_defaultMaxResponseHeadersLength(int value);
    // Get instance field reference: private System.Uri requestUri
    [[deprecated("Use field access instead!")]] ::System::Uri*& dyn_requestUri();
    // Get instance field reference: private System.Uri actualUri
    [[deprecated("Use field access instead!")]] ::System::Uri*& dyn_actualUri();
    // Get instance field reference: private System.Boolean hostChanged
    [[deprecated("Use field access instead!")]] bool& dyn_hostChanged();
    // Get instance field reference: private System.Boolean allowAutoRedirect
