// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::SpatialTracking
namespace UnityEngine::SpatialTracking {
  // Forward declaring type: PoseDataFlags
  struct PoseDataFlags;
  // Skipping declaration: TrackedPose because it is already included!
  // Skipping declaration: DeviceType because it is already included!
  // Skipping declaration: TrackingType because it is already included!
  // Skipping declaration: UpdateType because it is already included!
}
// Forward declaring namespace: UnityEngine::Experimental::XR::Interaction
namespace UnityEngine::Experimental::XR::Interaction {
  // Forward declaring type: BasePoseProvider
  class BasePoseProvider;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.SpatialTracking
namespace UnityEngine::SpatialTracking {
  // Forward declaring type: TrackedPoseDriver
  class TrackedPoseDriver;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::SpatialTracking::TrackedPoseDriver);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::SpatialTracking::TrackedPoseDriver*, "UnityEngine.SpatialTracking", "TrackedPoseDriver");
// Type namespace: UnityEngine.SpatialTracking
namespace UnityEngine::SpatialTracking {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.SpatialTracking.TrackedPoseDriver
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: AC9E2C
  // [AddComponentMenu] Offset: AC9E2C
  // [HelpURLAttribute] Offset: AC9E2C
  class TrackedPoseDriver : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType
    struct DeviceType;
    // Nested type: ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose
    struct TrackedPose;
    // Nested type: ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType
    struct TrackingType;
    // Nested type: ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType
    struct UpdateType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeviceType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DeviceType
      constexpr DeviceType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRDevice
      static constexpr const int GenericXRDevice = 0;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRDevice
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType _get_GenericXRDevice();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRDevice
      static void _set_GenericXRDevice(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRController
      static constexpr const int GenericXRController = 1;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRController
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType _get_GenericXRController();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRController
      static void _set_GenericXRController(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRRemote
      static constexpr const int GenericXRRemote = 2;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRRemote
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType _get_GenericXRRemote();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType GenericXRRemote
      static void _set_GenericXRRemote(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::DeviceType), 0 + sizeof(int)> __UnityEngine_SpatialTracking_TrackedPoseDriver_DeviceTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::DeviceType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackedPose/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackedPose
      constexpr TrackedPose(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose LeftEye
      static constexpr const int LeftEye = 0;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose LeftEye
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_LeftEye();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose LeftEye
      static void _set_LeftEye(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RightEye
      static constexpr const int RightEye = 1;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RightEye
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_RightEye();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RightEye
      static void _set_RightEye(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose Center
      static constexpr const int Center = 2;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose Center
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_Center();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose Center
      static void _set_Center(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose Head
      static constexpr const int Head = 3;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose Head
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_Head();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose Head
      static void _set_Head(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose LeftPose
      static constexpr const int LeftPose = 4;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose LeftPose
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_LeftPose();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose LeftPose
      static void _set_LeftPose(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RightPose
      static constexpr const int RightPose = 5;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RightPose
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_RightPose();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RightPose
      static void _set_RightPose(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose ColorCamera
      static constexpr const int ColorCamera = 6;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose ColorCamera
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_ColorCamera();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose ColorCamera
      static void _set_ColorCamera(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose DepthCameraDeprecated
      static constexpr const int DepthCameraDeprecated = 7;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose DepthCameraDeprecated
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_DepthCameraDeprecated();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose DepthCameraDeprecated
      static void _set_DepthCameraDeprecated(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose FisheyeCameraDeprected
      static constexpr const int FisheyeCameraDeprected = 8;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose FisheyeCameraDeprected
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_FisheyeCameraDeprected();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose FisheyeCameraDeprected
      static void _set_FisheyeCameraDeprected(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose DeviceDeprecated
      static constexpr const int DeviceDeprecated = 9;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose DeviceDeprecated
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_DeviceDeprecated();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose DeviceDeprecated
      static void _set_DeviceDeprecated(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RemotePose
      static constexpr const int RemotePose = 10;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RemotePose
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose _get_RemotePose();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose RemotePose
      static void _set_RemotePose(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::TrackedPose), 0 + sizeof(int)> __UnityEngine_SpatialTracking_TrackedPoseDriver_TrackedPoseSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::TrackedPose) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackingType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackingType
      constexpr TrackingType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType RotationAndPosition
      static constexpr const int RotationAndPosition = 0;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType RotationAndPosition
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType _get_RotationAndPosition();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType RotationAndPosition
      static void _set_RotationAndPosition(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType RotationOnly
      static constexpr const int RotationOnly = 1;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType RotationOnly
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType _get_RotationOnly();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType RotationOnly
      static void _set_RotationOnly(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType PositionOnly
      static constexpr const int PositionOnly = 2;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType PositionOnly
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType _get_PositionOnly();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType PositionOnly
      static void _set_PositionOnly(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::TrackingType), 0 + sizeof(int)> __UnityEngine_SpatialTracking_TrackedPoseDriver_TrackingTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::TrackingType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateType
      constexpr UpdateType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType UpdateAndBeforeRender
      static constexpr const int UpdateAndBeforeRender = 0;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType UpdateAndBeforeRender
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType _get_UpdateAndBeforeRender();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType UpdateAndBeforeRender
      static void _set_UpdateAndBeforeRender(::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType Update
      static constexpr const int Update = 1;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType Update
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType _get_Update();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType Update
      static void _set_Update(::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType value);
      // static field const value: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType BeforeRender
      static constexpr const int BeforeRender = 2;
      // Get static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType BeforeRender
      static ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType _get_BeforeRender();
      // Set static field: static public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType BeforeRender
      static void _set_BeforeRender(::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::UpdateType), 0 + sizeof(int)> __UnityEngine_SpatialTracking_TrackedPoseDriver_UpdateTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::UpdateType) == 0x4);
    public:
    // private UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType m_Device
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType m_Device;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType) == 0x4);
    // private UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose m_PoseSource
    // Size: 0x4
    // Offset: 0x1C
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose m_PoseSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose) == 0x4);
    // private UnityEngine.Experimental.XR.Interaction.BasePoseProvider m_PoseProviderComponent
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Experimental::XR::Interaction::BasePoseProvider* m_PoseProviderComponent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::XR::Interaction::BasePoseProvider*) == 0x8);
    // private UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType m_TrackingType
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType m_TrackingType;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType) == 0x4);
    // private UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType m_UpdateType
    // Size: 0x4
    // Offset: 0x2C
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType m_UpdateType;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType) == 0x4);
    // private System.Boolean m_UseRelativeTransform
    // Size: 0x1
    // Offset: 0x30
    bool m_UseRelativeTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseRelativeTransform and: m_OriginPose
    char __padding5[0x3] = {};
    // protected UnityEngine.Pose m_OriginPose
    // Size: 0x1C
    // Offset: 0x34
    ::UnityEngine::Pose m_OriginPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType m_Device
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType& dyn_m_Device();
    // Get instance field reference: private UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose m_PoseSource
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose& dyn_m_PoseSource();
    // Get instance field reference: private UnityEngine.Experimental.XR.Interaction.BasePoseProvider m_PoseProviderComponent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::XR::Interaction::BasePoseProvider*& dyn_m_PoseProviderComponent();
    // Get instance field reference: private UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType m_TrackingType
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType& dyn_m_TrackingType();
    // Get instance field reference: private UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType m_UpdateType
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType& dyn_m_UpdateType();
    // Get instance field reference: private System.Boolean m_UseRelativeTransform
    [[deprecated("Use field access instead!")]] bool& dyn_m_UseRelativeTransform();
    // Get instance field reference: protected UnityEngine.Pose m_OriginPose
    [[deprecated("Use field access instead!")]] ::UnityEngine::Pose& dyn_m_OriginPose();
    // public UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType get_deviceType()
    // Offset: 0x1B52748
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType get_deviceType();
    // System.Void set_deviceType(UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType value)
    // Offset: 0x1B52750
    void set_deviceType(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType value);
    // public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose get_poseSource()
    // Offset: 0x1B52758
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose get_poseSource();
    // System.Void set_poseSource(UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose value)
    // Offset: 0x1B52760
    void set_poseSource(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose value);
    // public System.Boolean SetPoseSource(UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType deviceType, UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose pose)
    // Offset: 0x1B52768
    bool SetPoseSource(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType deviceType, ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose pose);
    // public UnityEngine.Experimental.XR.Interaction.BasePoseProvider get_poseProviderComponent()
    // Offset: 0x1B5289C
    ::UnityEngine::Experimental::XR::Interaction::BasePoseProvider* get_poseProviderComponent();
    // public System.Void set_poseProviderComponent(UnityEngine.Experimental.XR.Interaction.BasePoseProvider value)
    // Offset: 0x1B528A4
    void set_poseProviderComponent(::UnityEngine::Experimental::XR::Interaction::BasePoseProvider* value);
    // private UnityEngine.SpatialTracking.PoseDataFlags GetPoseData(UnityEngine.SpatialTracking.TrackedPoseDriver/DeviceType device, UnityEngine.SpatialTracking.TrackedPoseDriver/TrackedPose poseSource, out UnityEngine.Pose resultPose)
    // Offset: 0x1B528AC
    ::UnityEngine::SpatialTracking::PoseDataFlags GetPoseData(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType device, ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose poseSource, ByRef<::UnityEngine::Pose> resultPose);
    // public UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType get_trackingType()
    // Offset: 0x1B52984
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType get_trackingType();
    // public System.Void set_trackingType(UnityEngine.SpatialTracking.TrackedPoseDriver/TrackingType value)
    // Offset: 0x1B5298C
    void set_trackingType(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType value);
    // public UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType get_updateType()
    // Offset: 0x1B52994
    ::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType get_updateType();
    // public System.Void set_updateType(UnityEngine.SpatialTracking.TrackedPoseDriver/UpdateType value)
    // Offset: 0x1B5299C
    void set_updateType(::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType value);
    // public System.Boolean get_UseRelativeTransform()
    // Offset: 0x1B529A4
    bool get_UseRelativeTransform();
    // public System.Void set_UseRelativeTransform(System.Boolean value)
    // Offset: 0x1B529AC
    void set_UseRelativeTransform(bool value);
    // public UnityEngine.Pose get_originPose()
    // Offset: 0x1B529B8
    ::UnityEngine::Pose get_originPose();
    // public System.Void set_originPose(UnityEngine.Pose value)
    // Offset: 0x1B529CC
    void set_originPose(::UnityEngine::Pose value);
    // private System.Void CacheLocalPosition()
    // Offset: 0x1B529E8
    void CacheLocalPosition();
    // private System.Void ResetToCachedLocalPosition()
    // Offset: 0x1B52A44
    void ResetToCachedLocalPosition();
    // protected System.Void Awake()
    // Offset: 0x1B52A64
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x1B52A68
    void OnDestroy();
    // protected System.Void OnEnable()
    // Offset: 0x1B52A6C
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0x1B52AE4
    void OnDisable();
    // protected System.Void FixedUpdate()
    // Offset: 0x1B52B64
    void FixedUpdate();
    // protected System.Void Update()
    // Offset: 0x1B52B80
    void Update();
    // protected System.Void OnBeforeRender()
    // Offset: 0x1B52B9C
    void OnBeforeRender();
    // protected System.Void SetLocalTransform(UnityEngine.Vector3 newPosition, UnityEngine.Quaternion newRotation, UnityEngine.SpatialTracking.PoseDataFlags poseFlags)
    // Offset: 0x1B52BBC
    void SetLocalTransform(::UnityEngine::Vector3 newPosition, ::UnityEngine::Quaternion newRotation, ::UnityEngine::SpatialTracking::PoseDataFlags poseFlags);
    // protected UnityEngine.Pose TransformPoseByOriginIfNeeded(UnityEngine.Pose pose)
    // Offset: 0x1B52CA4
    ::UnityEngine::Pose TransformPoseByOriginIfNeeded(::UnityEngine::Pose pose);
    // private System.Boolean HasStereoCamera()
    // Offset: 0x1B52CFC
    bool HasStereoCamera();
    // protected System.Void PerformUpdate()
    // Offset: 0x1B52DAC
    void PerformUpdate();
    // public System.Void .ctor()
    // Offset: 0x1B52EE4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TrackedPoseDriver* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::SpatialTracking::TrackedPoseDriver::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TrackedPoseDriver*, creationType>()));
    }
  }; // UnityEngine.SpatialTracking.TrackedPoseDriver
  #pragma pack(pop)
  static check_size<sizeof(TrackedPoseDriver), 52 + sizeof(::UnityEngine::Pose)> __UnityEngine_SpatialTracking_TrackedPoseDriverSizeCheck;
  static_assert(sizeof(TrackedPoseDriver) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::SpatialTracking::TrackedPoseDriver::UpdateType, "UnityEngine.SpatialTracking", "TrackedPoseDriver/UpdateType");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackingType, "UnityEngine.SpatialTracking", "TrackedPoseDriver/TrackingType");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::SpatialTracking::TrackedPoseDriver::TrackedPose, "UnityEngine.SpatialTracking", "TrackedPoseDriver/TrackedPose");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::SpatialTracking::TrackedPoseDriver::DeviceType, "UnityEngine.SpatialTracking", "TrackedPoseDriver/DeviceType");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
